{"main_page": "https://arxiv.org/abs/", "pdf": "https://arxiv.org/pdf/", "title": "Title:\n          Unveiling the role of magnetic fields in an accreting filament onto a young protocluster", "authors": "Farideh S. Tabatabaei, Elena Redaelli, Daniele Galli, Paola Caselli, Gabriel A. P. Franco, Ana Duarte-Cabral, Marco Padovani", "subjects": "Subjects:\nAstrophysics of Galaxies (astro-ph.GA)", "abstract": "In order to develop a more comprehensive picture of star formation, it is essential to understand the physical relationship between dense cores and the filaments embedding them. There is evidence that magnetic fields play a crucial role in this context. We aim to understand how magnetic fields influence the properties and kinematics of an isolated filament located east of the Barnard 59 clump, belonging to the Pipe Nebula. We use near infrared polarization observations to determine the magnetic field configuration, and we apply the Davis Chandrasekhar Fermi method to infer the magnetic field strength in the plane of the sky. Furthermore, we use complementary data from the James Clerk Maxwell Submillimetre Telescope (JCMT) of C18O and 13CO J=3-2 transition to determine the filament's kinematics. Finally, we model the radial density profile of the filament with polytropic cylindrical models. Our results indicate that the filament is stable to radial collapse and is radially supported by agents other than thermal pressure. In addition, based on previous observations of emission lines on this source, we suggest that gas is flowing toward the hub, while C18O (3-2) non-thermal motions indicate that the cloud is in a quiescent state."}
{"main_page": "https://arxiv.org/abs/", "pdf": "https://arxiv.org/pdf/", "title": "Title:\n          HATS-38 b and WASP-139 b join a growing group of eccentric hot Neptunes on polar orbits", "authors": "Juan I. Espinoza-Retamal, Guðmundur Stefánsson, Cristobal Petrovich, Rafael Brahm, Andrés Jordán, Elyar Sedaghati, Jennifer P. Lucero, Marcelo Tala Pinto, Diego J. Muñoz, Gavin Boyle, Rodrigo Leiva, Vincent Suc", "subjects": "Subjects:\nEarth and Planetary Astrophysics (astro-ph.EP)", "abstract": "We constrain the sky-projected obliquities of two low-density hot Neptune planets HATS-38 b and WASP-139 b orbiting nearby G and K stars using Rossiter-McLaughlin (RM) observations with VLT/ESPRESSO, yielding $\\lambda = -108_{-16}^{+11}$ deg and $-85.6_{-4.2}^{+7.7}$ deg, respectively. To model the RM effect, we use a new publicly available code, \\texttt{ironman}, which is capable of jointly fitting transit photometry, Keplerian radial velocities, and RM effects. The two planets have residual eccentricities ($e= 0.112_{-0.070}^{+0.072}$, and $0.103_{-0.041}^{+0.050}$, respectively), and together with the obliquity constraints, we show that they join a growing group of eccentric hot and low-density Neptunes on polar orbits. We use long-term radial velocities to rule out companions with masses $\\sim 0.3-50$ $M_J$ within $\\sim$10 au. We show that the orbital architectures of the two Neptunes disfavor an origin from primordial disk misalignment and/or in-situ secular interactions with distant companions and instead favor high-eccentricity migration from $\\gtrsim 2$ au driven by a distant companion. Finally, we performed a hierarchical Bayesian modeling of the true obliquity distribution of Neptunes and found suggestive evidence for a higher preponderance of polar orbits of hot Neptunes compared to Jupiters. However, we note that the exact distribution is sensitive to the choice of priors, highlighting the need for additional obliquity measurements of Neptunes to robustly compare the hot Neptune obliquity distribution to Jupiters."}
{"main_page": "https://arxiv.org/abs/", "pdf": "https://arxiv.org/pdf/", "title": "Title:\n          The Pristine Inner Galaxy Survey (PIGS) X. Probing the early chemical evolution of the Sagittarius dwarf galaxy with carbon abundances", "authors": "Federico Sestito, Anke Ardern-Arentsen, Sara Vitali, Martin Montelius, Romain Lucchesi, Kim A. Venn, Nicolas F. Martin, Julio F. Navarro, Else Starkenburg", "subjects": "Subjects:\nAstrophysics of Galaxies (astro-ph.GA); Solar and Stellar Astrophysics (astro-ph.SR)", "abstract": "Carbon abundances, especially at low metallicity, reveal the early chemical evolution of a system, tracing the supernovae (SNe) that contributed and how much of their ejecta made it into the next stellar generation. Our sample from the \\textit{Pristine} Inner Galaxy Survey (PIGS) includes $\\sim 350$ metal-poor ([Fe/H]~$<-1.5$) stars in the main body of Sgr with good quality spectroscopic observations. Our metal-poor Sgr population has a larger velocity dispersion than metal-rich Sgr from the literature, which could be explained by outside-in star formation, extreme Galactic tidal perturbations and/or the presence of a metal-rich disc/bar $+$ a metal-poor halo. The average carbon abundance in Sgr is similar to that of other classical dwarf galaxies (DGs) and consistently lower than in the Milky Way by $\\sim0.2-0.3$~dex at low metallicity. The interstellar medium in DGs, including Sgr, may have retained yields from more energetic Pop III and II SNe, thereby reducing the average [C/Fe]. Additionally, SNe~Ia, producing more Fe than C, would start to contribute at lower metallicity in DGs/Sgr than in the Galaxy. The presence of a [C/Fe] gradient for Sgr stars with [Fe/H]~$\\gtrsim-2.0$ ($\\sim 6.8\\times 10^{-4}$ dex arcmin$^{-1}$) suggests that SNe~Ia contributed in the system at those metallicities, especially in its inner regions. There is a low frequency of carbon-enhanced metal-poor (CEMP) stars in our Sgr sample. At higher metallicity/carbon abundance (mostly CEMP-s) this may be due to photometric selection effects, but those are less likely to affect CEMP-no stars. We propose that, given the lower average [C/Fe] in DGs, using the same CEMP definition ([C/Fe]~$>+0.7$) as in the Galaxy under-predicts the number of CEMP stars in DGs, and for Sgr a cut at [C/Fe]$~\\sim +0.35$ may be more appropriate, which brings the frequency of CEMP stars in agreement with that in the Galaxy."}
{"main_page": "https://arxiv.org/abs/", "pdf": "https://arxiv.org/pdf/", "title": "Title:\n          Rapid Mid-Infrared Spectral-Timing with JWST. I. The prototypical black hole X-ray Binary GRS 1915+105 during a MIR-bright and X-ray-obscured state", "authors": "P. Gandhi (Univ. Southampton), E.S. Borowski, J. Byrom, R.I. Hynes, T.J. Maccarone, A.W. Shaw, O.K. Adegoke, D. Altamirano, M.C. Baglio, Y. Bhargava, C.T. Britt, D.A.H. Buckley, D.J.K. Buisson, P. Casella, N. Castro Segura, P.A. Charles, J.M. Corral-Santana, V.S. Dhillon, R. Fender, A. Gúrpide, C.O. Heinke, A.B. Igl, C. Knigge, S. Markoff, G. Mastroserio, M.L. McCollough, M. Middleton, J.M. Miller, J.C.A. Miller-Jones, S.E. Motta, J.A. Paice, D.D. Pawar, R.M. Plotkin, P. Pradhan, M.E. Ressler, D.M. Russell, T.D. Russell, P. Santos-Sanz, T. Shahbaz, G.R. Sivakoff, D. Steeghs, A.J. Tetarenko, J.A. Tomsick, F.M. Vincentelli, M. George, M. Gurwell, R. Rao", "subjects": "Subjects:\nHigh Energy Astrophysical Phenomena (astro-ph.HE); Solar and Stellar Astrophysics (astro-ph.SR)", "abstract": "We present mid-infrared (MIR) spectral-timing measurements of the prototypical Galactic microquasar GRS 1915+105. The source was observed with the Mid-Infrared Instrument (MIRI) onboard JWST in June 2023 at a MIR luminosity L(MIR)~10^{36} erg/s exceeding past IR levels by about a factor of 10. By contrast, the X-ray flux is much fainter than the historical average, in the source's now-persistent 'obscured' state. The MIRI low-resolution spectrum shows a plethora of emission lines, the strongest of which are consistent with recombination in the hydrogen Pfund (Pf) series and higher. Low amplitude (~1%) but highly significant peak-to-peak photometric variability is found on timescales of ~1,000 s. The brightest Pf(6-5) emission line lags the continuum. Though difficult to constrain accurately, this lag is commensurate with light-travel timescales across the outer accretion disc or with expected recombination timescales inferred from emission line diagnostics. Using the emission line as a bolometric indicator suggests a moderate (~5-30% Eddington) intrinsic accretion rate. Multiwavelength monitoring shows that JWST caught the source close in-time to unprecedentedly bright MIR and radio long-term flaring. Assuming a thermal bremsstrahlung origin for the MIRI continuum suggests an unsustainably high mass-loss rate during this time unless the wind remains bound, though other possible origins cannot be ruled out. PAH features previously detected with Spitzer are now less clear in the MIRI data, arguing for possible destruction of dust in the interim. These results provide a preview of new parameter space for exploring MIR spectral-timing in XRBs and other variable cosmic sources on rapid timescales."}
{"main_page": "https://arxiv.org/abs/", "pdf": "https://arxiv.org/pdf/", "title": "Title:\n          Absence of a Correlation between White Dwarf Planetary Accretion and Primordial Stellar Metallicity", "authors": "Sydney Jenkins, Andrew Vanderburg, Allyson Bieryla, David W. Latham, Mariona Badenas-Agusti, Perry Berlind, Simon Blouin, Lars A. Buchhave, Michael L. Calkins, Gilbert A. Esquerdo, Javier Viaña", "subjects": "Subjects:\nEarth and Planetary Astrophysics (astro-ph.EP); Solar and Stellar Astrophysics (astro-ph.SR)", "abstract": "Over a quarter of white dwarfs have photospheric metal pollution, which is evidence for recent accretion of exoplanetary material. While a wide range of mechanisms have been proposed to account for this pollution, there are currently few observational constraints to differentiate between them. To investigate the driving mechanism, we observe a sample of polluted and non-polluted white dwarfs in wide binary systems with main-sequence stars. Using the companion stars' metallicities as a proxy for the white dwarfs' primordial metallicities, we compare the metallicities of polluted and non-polluted systems. Because there is a well-known correlation between giant planet occurrence and higher metallicity (with a stronger correlation for close-in and eccentric planets), these metallicity distributions can be used to probe the role of gas giants in white dwarf accretion. We find that the metallicity distributions of polluted and non-polluted systems are consistent with the hypothesis that both samples have the same underlying metallicity distribution. However, we note that this result is likely biased by several selection effects. Additionally, we find no significant trend between white dwarf accretion rates and metallicity. These findings suggest that giant planets are not the dominant cause of white dwarf accretion events in binary systems."}
{"main_page": "https://arxiv.org/abs/", "pdf": "https://arxiv.org/pdf/", "title": "Title:\n          Not So Round: VLA Observations of the Starless Dark Matter Halo Candidate Cloud-9", "authors": "Alejandro Benítez-Llambay, Rajeshwari Dutta, Michele Fumagalli, Julio F. Navarro", "subjects": "Subjects:\nAstrophysics of Galaxies (astro-ph.GA); Cosmology and Nongalactic Astrophysics (astro-ph.CO)", "abstract": "Observations with FAST recently detected HI 21-cm emission near M94, revealing an intriguing object, Cloud-9, without an optical counterpart. Subsequent analysis suggests Cloud-9 is consistent with a gas-rich ($M_{\\rm HI} \\approx 10^{6} \\ M_{\\odot}$), starless dark matter (DM) halo of mass $M_{200} \\approx 5 \\times 10^{9} \\ M_{\\odot}$. Using VLA in D-array configuration, we present interferometric observations of Cloud-9 revealing it as a dynamically cold ($W_{50} \\approx 12 \\rm \\ km \\ s^{-1}$), non-rotating, and spatially-asymmetric system, exhibiting gas compression on one side and a tail-like structure towards the other, features likely originating from ram pressure. Our observations suggest Cloud-9 is consistent with a starless $\\Lambda$CDM dark matter halo if the gas is largely isothermal. If interpreted as a faint dwarf, Cloud-9 is similar to Leo T, a nearby gas-rich galaxy that would fall below current optical detection limits at Cloud-9's distance ($d\\approx 5 \\rm \\ Mpc$). Further observations with HST reaching magnitudes $m_{g} \\approx 30$ would help identify such a galaxy or dramatically lower current limits to its stellar mass ($M_{\\rm gal} \\lesssim 10^{5} \\ M_{\\odot}$). Cloud-9 thus stands as the firmest starless DM halo candidate to date or the faintest galaxy known at its distance."}
{"main_page": "https://arxiv.org/abs/", "pdf": "https://arxiv.org/pdf/", "title": "Title:\n          Using 3.4-$\\mu$m Variability towards White Dwarfs as a Signpost of Remnant Planetary Systems", "authors": "Joseph A. Guidry, J. J. Hermes, Kishalay De, Lou Baya Ould Rouis, Brison B. Ewing, B. C. Kaiser", "subjects": "Subjects:\nSolar and Stellar Astrophysics (astro-ph.SR); Earth and Planetary Astrophysics (astro-ph.EP); Instrumentation and Methods for Astrophysics (astro-ph.IM)", "abstract": "Roughly 2% of white dwarfs harbor planetary debris disks detectable via infrared excesses, but only a few percent of these disks show a gaseous component, distinguished by their double-peaked emission at the near-infrared calcium triplet. Previous studies found most debris disks around white dwarfs are variable at 3.4 and 4.5 $\\mu$m, but they analyzed only a few of the now 21 published disks showing calcium emission. To test if most published calcium emission disks exhibit large-amplitude stochastic variability in the near-infrared, we use light curves generated from the unWISE images at 3.4 $\\mu$m that are corrected for proper motion to characterize the near-infrared variability of these disks against samples of disks without calcium emission, highly variable cataclysmic variables, and 3215 isolated white dwarfs. We find most calcium emission disks are extremely variable: 6/11 with sufficient signal-to-noise show high-amplitude variability in their 3.4-$\\mu$m light curves. These results lend further credence to the notion that disks showing gaseous debris in emission are the most collisionally active. Under the assumption that 3.4-$\\mu$m variability is characteristic of white dwarfs with dusty debris disks, we generate a catalog of 104 high-confidence near-infrared variable white dwarfs, 84 of which are published as variable for the first time. We do near-infrared spectroscopic follow-up of seven new candidate 3.4-$\\mu$m variables, confirming at least one new remnant planetary system, and posit that empirical near-infrared variability can be a discovery engine for debris disks showing gaseous emission."}
{"main_page": "https://arxiv.org/abs/", "pdf": "https://arxiv.org/pdf/", "title": "Title:\n          An effective model for the tidal disruption of satellites undergoing minor mergers with axisymmetric primaries", "authors": "Ludovica Varisco, Massimo Dotti, Matteo Bonetti, Elisa Bortolas, Alessandro Lupi", "subjects": "Subjects:\nAstrophysics of Galaxies (astro-ph.GA)", "abstract": "According to the hierarchical formation paradigm, galaxies form through mergers of smaller entities and massive black holes (MBHs), if lurking at their centers, migrate to the nucleus of the newly formed galaxy, where they form binary systems. The formation and evolution of MBH binaries, and in particular their coalescence timescale, is very relevant for current and future facilities aimed at detecting the gravitational-wave signal produced by the MBH close to coalescence. While most of the studies targeting this process are based on hydrodynamic simulations, the high computational cost makes a complete parameter space exploration prohibitive. Semi-analytic approaches represent a valid alternative, but they require ad-hoc prescriptions for the mass loss of the merging galaxies in minor mergers due to tidal stripping, which is not commonly considered or at most modelled assuming very idealised geometries. In this work, we propose a novel, effective model for the tidal stripping in axisymmetric potentials, to be implemented in semi-analytic models. We validate our semi-analytic approach against N-body simulations considering different galaxy sizes, inclinations, and eccentricities, finding only a moderate dependence on the orbit eccentricity. In particular, we find that, for almost circular orbits, our model mildly overestimates the mass loss, and this is due to the adjustment of the stellar distribution after the mass is removed. Nonetheless, the model exhibits a very good agreement with simulations in all the considered conditions, and thus represents an extremely powerful addition to semi-analytic calculations."}
{"main_page": "https://arxiv.org/abs/", "pdf": "https://arxiv.org/pdf/", "title": "Title:\n          Unveiling the internal structure and formation history of the three planets transiting HIP 29442 (TOI-469) with CHEOPS", "authors": "J. A. Egger, H. P. Osborn, D. Kubyshkina, C. Mordasini, Y. Alibert, M. N. Günther, M. Lendl, A. Brandeker, A. Heitzmann, A. Leleu, M. Damasso, A. Bonfanti, T. G. Wilson, S. G. Sousa, J. Haldemann, L. Delrez, M. J. Hooton, T. Zingales, R. Luque, R. Alonso, J. Asquier, T. Bárczy, D. Barrado Navascues, S. C. C. Barros, W. Baumjohann, W. Benz, N. Billot, L. Borsato, C. Broeg, M. Buder, A. Castro-González, A. Collier Cameron, A. C. M. Correia, D. Cortes, Sz. Csizmadia, P. E. Cubillos, M. B. Davies, M. Deleuil, A. Deline, O. D. S. Demangeon, B.-O. Demory, A. Derekas, B. Edwards, D. Ehrenreich, A. Erikson, A. Fortier, L. Fossati, M. Fridlund, D. Gandolfi, K. Gazeas, M. Gillon, M. Güdel, Ch. Helling, K. G. Isaak, L. L. Kiss, J. Korth, K. W. F. Lam, J. Laskar, B. Lavie, A. Lecavelier des Etangs, C. Lovis, A. Luntzer, D. Magrin, P. F. L. Maxted, B. Merín, M. Munari, V. Nascimbeni, G. Olofsson, R. Ottensamer, I. Pagano, E. Pallé, G. Peter, D. Piazza, G. Piotto, D. Pollacco, D. Queloz, R. Ragazzoni, N. Rando, H. Rauer, I. Ribas, J. Rodrigues, N. C. Santos, G. Scandariato, D. Ségransan, A. E. Simon, A. M. S. Smith, M. Stalport, S. Sulis, Gy. M. Szabó, S. Udry, V. Van Grootel, J. Venturini, E. Villaver, N. A. Walton", "subjects": "Subjects:\nEarth and Planetary Astrophysics (astro-ph.EP)", "abstract": "Multiplanetary systems spanning the radius valley are ideal testing grounds for exploring the proposed explanations for the observed bimodality in the radius distribution of close-in exoplanets. One such system is HIP 29442 (TOI-469), an evolved K0V star hosting two super-Earths and a sub-Neptune. We observe HIP 29442 with CHEOPS for a total of 9.6 days, which we model jointly with 2 sectors of TESS data to derive planetary radii of $3.410\\pm0.046$, $1.551\\pm0.045$ and $1.538\\pm0.049$ R$_\\oplus$ for planets b, c and d, which orbit HIP 29442 with periods of 13.6, 3.5 and 6.4 days. For planet d, this value deviates by more than 3 sigma from the median value reported in the discovery paper, leading us to conclude that caution is required when using TESS photometry to determine the radii of small planets with low per-transit S/N and large gaps between observations. Given the high precision of these new radii, combining them with published RVs from ESPRESSO and HIRES provides us with ideal conditions to investigate the internal structure and formation pathways of the planets in the system. We introduce the publicly available code plaNETic, a fast and robust neural network-based Bayesian internal structure modelling framework. We then apply hydrodynamic models to explore the upper atmospheric properties of these inferred structures. Finally, we identify planetary system analogues in a synthetic population generated with the Bern model for planet formation and evolution. Based on this analysis, we find that the planets likely formed on opposing sides of the water iceline from a protoplanetary disk with an intermediate solid mass. We finally report that the observed parameters of the HIP 29442 system are compatible with both a scenario where the second peak in the bimodal radius distribution corresponds to sub-Neptunes with a pure H/He envelope as well as a scenario with water-rich sub-Neptunes."}
{"main_page": "https://arxiv.org/abs/", "pdf": "https://arxiv.org/pdf/", "title": "Title:\n          Fundamentalization of periods for first and second-overtone classical Cepheids", "authors": "Bogumił Pilecki", "subjects": "Subjects:\nSolar and Stellar Astrophysics (astro-ph.SR); Astrophysics of Galaxies (astro-ph.GA)", "abstract": "Almost half of all classical Cepheids do not pulsate in fundamental mode, and nowadays, the fundamentalization of their higher-mode periods is frequently applied to increase the sample size in astrophysical investigations and allow for comparison with fundamental-mode Cepheids. On the other hand, the relations used to obtain fundamentalized periods are either old or based on small samples that cover narrow period ranges. We used available data of 989 Cepheids pulsating in at least two modes to obtain modern, high-quality empirical fundamentalization relations applicable in a wide range of periods of first- and second-overtone Cepheids for metallicities typical for the Milky Way and Magellanic Clouds. A clear correlation between the features of these relations and metallicity is seen, and periods with lower sensitivity to metallicity are identified. We also compare our results with double-mode Cepheids from the M31 and M33 galaxies. For the first galaxy, this indicates Cepheids have metallicities from supersolar to typical for the LMC, while for the latter, from solar to typical for the SMC. A general discussion of the usage of a different type of fundamentalization relations depending on the scientific problem is included."}
{"main_page": "https://arxiv.org/abs/", "pdf": "https://arxiv.org/pdf/", "title": "Title:\n          Exploring the Complex Ionization Environment of the Turbulent DM Tau Disk", "authors": "Deryl E. Long, L. Ilsedore Cleeves, Fred C. Adams, Sean Andrews, Edwin A. Bergin, Viviana V. Guzmán, Jane Huang, A. Meredith Hughes, Chunhua Qi, Kamber Schwarz, Jacob B. Simon, David Wilner", "subjects": "Subjects:\nSolar and Stellar Astrophysics (astro-ph.SR); Earth and Planetary Astrophysics (astro-ph.EP); Astrophysics of Galaxies (astro-ph.GA)", "abstract": "Ionization drives important chemical and dynamical processes within protoplanetary disks, including the formation of organics and water in the cold midplane and the transportation of material via accretion and magneto-hydrodynamic (MHD) flows. Understanding these ionization-driven processes is crucial for understanding disk evolution and planet formation. We use new and archival ALMA observations of HCO+, H13CO+, and N2H+ to produce the first forward-modeled 2D ionization constraints for the DM Tau protoplanetary disk. We include ionization from multiple sources and explore the disk chemistry under a range of ionizing conditions. Abundances from our 2D chemical models are post-processed using non-LTE radiative transfer, visibility sampling, and imaging, and are compared directly to the observed radial emission profiles. The observations are best fit by a modestly reduced CR ionization rate ($\\zeta_{CR}$ ~ 10$^{-18}$ s$^{-1}$) and a hard X-ray spectrum (hardness ratio [HR] = 0.3), which we associate with stellar flaring conditions. Our best-fit model under-produces emission in the inner disk, suggesting that there may be an additional mechanism enhancing ionization in DM Tau's inner disk. Overall, our findings highlight the complexity of ionization in protoplanetary disks and the need for high resolution multi-line studies."}
{"main_page": "https://arxiv.org/abs/", "pdf": "https://arxiv.org/pdf/", "title": "Title:\n          Optical modeling for the evaluation of HOWFSC on embedded processors", "authors": "Kian Milani, Ewan Douglas, Leonid Pogorelyuk, Christopher Mendillo, Kerri Cahoy, Nicholas Belsten, Brandon Eickert, Shanti Rao", "subjects": "Subjects:\nInstrumentation and Methods for Astrophysics (astro-ph.IM)", "abstract": "The correction of quasi-static wavefront errors within a coronagraphic optical system will be a key challenge to overcome in order to directly image exoplanets in reflected light. These quasi-static errors are caused by mid to high-order surface errors on the optical elements as a result of manufacturing processes. Using high-order wavefront sensing and control (HOWFSC) techniques that do not introduce non-common path aberrations, the quasi-static errors can be corrected within the desired region of interest designated as the dark hole. For the future Habitable Worlds Observatory (HWO), HOWFSC algorithms will be key to attaining the desired contrasts. To simulate the performance of HOWFSC with space rated processors, optical models for a 6 m class space-borne observatory and a coronagraph have been developed. Phenomena such as the Talbot effect and beamwalk are included in the simulations using combinations of ray-based modeling and end-to-end propagation techniques. After integrating the optical models with the embedded processors, simulations with realistic computation times can be performed to understand the computational hardware performance that will be needed to maintain the desired contrasts. Here, the details of the optical models are presented along with the HOWFSC methods utilized. Initial results of the HOWFSC methods are also included as a demonstration of how system drifts will degrade the contrast and require dark hole maintenance."}
{"main_page": "https://arxiv.org/abs/", "pdf": "https://arxiv.org/pdf/", "title": "Title:\n          Deriving the star formation histories of galaxies from spectra with simulation-based inference", "authors": "Patricia Iglesias-Navarro, Marc Huertas-Company, Ignacio Martín-Navarro, Johan H. Knapen, Emilie Pernet", "subjects": "Subjects:\nAstrophysics of Galaxies (astro-ph.GA)", "abstract": "High-resolution galaxy spectra encode information about the stellar populations within galaxies. The properties of the stars, such as their ages, masses, and metallicities, provide insights into the underlying physical processes that drive the growth and transformation of galaxies over cosmic time. We explore a simulation-based inference (SBI) workflow to infer from optical absorption spectra the posterior distributions of metallicities and the star formation histories (SFHs) of galaxies (i.e. the star formation rate as a function of time). We generated a dataset of synthetic spectra to train and test our model using the spectroscopic predictions of the MILES stellar population library and non-parametric SFHs. We reliably estimate the mass assembly of an integrated stellar population with well-calibrated uncertainties. Specifically, we reach a score of $0.97\\,R^2$ for the time at which a given galaxy from the test set formed $50\\%$ of its stellar mass, obtaining samples of the posteriors in only $10^{-4}$\\,s. We then applied the pipeline to real observations of massive elliptical galaxies, recovering the well-known relationship between the age and the velocity dispersion, and show that the most massive galaxies ($\\sigma\\sim300$ km/s) built up to 90\\% of their total stellar masses within $1$\\,Gyr of the Big Bang. The inferred properties also agree with the state-of-the-art inversion codes, but the inference is performed up to five orders of magnitude faster. This SBI approach coupled with machine learning and applied to full spectral fitting makes it possible to address large numbers of galaxies while performing a thick sampling of the posteriors. It will allow both the deterministic trends and the inherent uncertainties of the highly degenerated inversion problem to be estimated for large and complex upcoming spectroscopic surveys, such as DESI, WEAVE, or 4MOST."}
{"main_page": "https://arxiv.org/abs/", "pdf": "https://arxiv.org/pdf/", "title": "Title:\n          Enhanced particle acceleration in a pulsar wind interacting with a companion", "authors": "Valentina Richard Romei, Benoît Cerutti", "subjects": "Subjects:\nHigh Energy Astrophysical Phenomena (astro-ph.HE)", "abstract": "Pulsar winds have been shown to be preferred sites of particle acceleration and high-energy radiation. Numerous studies have been conducted to better characterize the general structure of such relativistic plasmas in isolated systems. However, many pulsars are found in binary systems and there are currently no ab initio models available that would include both the pulsar magnetosphere and the wind of the pulsar in interaction with a spherical companion. We investigate the interaction between a pulsar wind and a companion to probe the rearrangement of the pulsar wind, assess whether it leads to an enhancement of particle acceleration, and predict the high-energy radiative signature that stems from this interaction. We perform two-dimensional equatorial particle-in-cell simulations of an inclined pulsar surrounded by a spherical, unmagnetized, perfectly conducting companion settled in its wind. We find that the presence of the companion significantly alters the structure of the wind. When the companion lies beyond the fast magnetosonic point, a shock is established and the perturbations are advected in a cone behind the companion. We observe an enhancement of particle acceleration due to forced reconnection as the current sheet reaches the companion surface. Hence, high-energy synchrotron radiation is also amplified. The orbital light curves display two broad peaks reaching up to 14 times the high-energy pulsed flux emitted by an isolated pulsar magnetosphere. These effects increase with the growth of the companion size and with the decrease of the pulsar-companion separation. The present study suggests that a pulsar wind interacting with a companion induces a significant enhancement of high-energy radiation that takes the form of an orbital-modulated hollow cone of emission, which should be detectable by galactic-plane surveys, possibly with long-period radio transient counterparts."}
{"main_page": "https://arxiv.org/abs/", "pdf": "https://arxiv.org/pdf/", "title": "Title:\n          Li Evolution Among Stars of Low/Intermediate Mass: The Metal-Deficient Open Cluster, NGC 2204", "authors": "Barbara J. Anthony-Twarog (1), Constantine P. Deliyannis (2), Aaron Steinhauer (3), Qinghui Sun,  (4 and 5), Bruce A. Twarog (1) ((1) Univ. of Kansas, (2) Indiana Univ., (3) SUNY-Geneseo, (4) T.-D. Lee Inst, Shanghai, (5) Tsinghua Univ, Beijing)", "subjects": "Subjects:\nSolar and Stellar Astrophysics (astro-ph.SR)", "abstract": "We have analyzed high-dispersion spectra in the Li 6708 Angstrom region for 167 stars within the anticenter cluster, NGC 2204. From 105 probable members, abundance analysis of 45 evolved stars produces [Fe/H] = -0.40 +/- 0.12, [Si/Fe] = 0.14 +/- 0.12, [Ca/Fe] = 0.29 +/- 0.07, and [Ni/Fe] = -0.12 +/- 0.10, where quoted errors are standard deviations. With E(B-V) = 0.07 and (m-M)_0 = 13.12, appropriate isochrones provide an excellent match from the main sequence through the tip of the giant branch for an age of 1.85 +/- 0.05 Gyr. Li spectrum synthesis produces A(Li) below 1.4 at the base of the red giant branch to a detectable value of -0.4 at the tip. Six probable AGB stars and all but one red clump star have only Li upper limits. A rapidly rotating red giant is identified as a possible Li-rich giant, assuming it is a red clump star. Main sequence turnoff stars have a well-defined A(Li) = 2.83 +/- 0.03 (sem) down to the Li-dip wall at the predicted mass of 1.29 solar masses. Despite the same isochronal age as the more metal-rich NGC 2506, the red giant luminosity distribution reflects a younger morphology similar to NGC 7789, possibly indicating a deeper metallicity impact on stellar structure and A(Li) than previously assumed. As in NGC 2506 and NGC 7789, the NGC 2204 turnoff exhibits a broad range of rotation speeds, making abundance estimation impossible for some stars. The cluster place within Galactic A(Li) evolution is discussed."}
{"main_page": "https://arxiv.org/abs/", "pdf": "https://arxiv.org/pdf/", "title": "Title:\n          Pulsational mode stability in complex EiBI-gravitating polarized astroclouds with (r, q)-distributed electrons", "authors": "Dipankar Ray, Pralay Kumar Karmakar", "subjects": "Subjects:\nAstrophysics of Galaxies (astro-ph.GA); Plasma Physics (physics.plasm-ph)", "abstract": "The pulsational mode of gravitational collapse (PMGC) originating from the combined gravito-electrostatic interaction in complex dust molecular clouds (DMCs) is a canonical mechanisms leading to the onset of astronomical structure formation dynamics. A semi-analytic generalized model is formulated to examine the collective effects of polarization force, Eddington-inspired Born-Infeld (EiBI) gravity, and non-thermal (r, q)-distributed electrons on the stability of the PMGC concurrently. The ions are treated with the help of the Maxwellian thermo-statistical distribution law whereas the electrons are modelled with the non-thermal (r, q)-distribution law. The dust species including neutral and negatively charged particles are treated as fluids. A spherical normal mode analysis obtains a quartic linear dispersion relation for the PMGC. The oscillatory and propagation characteristics of the PMGC mode dynamics are investigated on a constructed numerical platform. It found that an increase in the polarization force and positive EiBI parameter significantly enhances the instability resulting in the DMC collapse, and vice versa. The electron non-thermality spectral parameters play a vital role as stabilizing factor. Its reliability and applicability are finally outlined in light of the previous astronomical studies in the same thematic direction."}
{"main_page": "https://arxiv.org/abs/", "pdf": "https://arxiv.org/pdf/", "title": "Title:\n          Cosmic Reionization in the JWST Era: Back to AGNs?", "authors": "Piero Madau, Emanuele Giallongo, Andrea Grazian, Francesco Haardt", "subjects": "Subjects:\nCosmology and Nongalactic Astrophysics (astro-ph.CO); Astrophysics of Galaxies (astro-ph.GA)", "abstract": "Deep surveys with the James Webb Space Telescope (JWST) have revealed an emergent population of moderate-luminosity, broad-line active galactic nuclei (AGNs) at 4< z< 14 powered by accretion onto early massive black holes. The high number densities reported, together with the large Lyman-continuum (LyC) production efficiency and leakiness into the intergalactic medium (IGM) that are typical of UV-selected AGNs, lead us to reassess a scenario where AGNs are the sole drivers of the cosmic hydrogen/helium reionization process. Our approach is based on the assumptions, grounded in recent observations, that: (a) the fraction of broad-line AGNs among galaxies is around 10-15%; (b) the mean escape fraction of hydrogen LyC radiation is high, >80%, in AGN hosts and is negligible otherwise; and (c) internal absorption at 4 ryd or a steep ionizing EUV spectrum delay full reionization of HeII until z~2.8-3.0, in agreement with observations of the HeII Lyman-alpha forest. In our fiducial models: 1) hydrogen reionization is 99% completed by redshift z~5.3-5.5, and reaches its midpoint at z~6.5-6.7; (2) the integrated Thomson scattering optical depth to reionization is ~0.05, consistent with constraints from cosmic microwave background (CMB) anisotropy data; and (3) the abundant AGN population detected by JWST does not violate constraints on the unresolved X-ray background."}
{"main_page": "https://arxiv.org/abs/", "pdf": "https://arxiv.org/pdf/", "title": "Title:\n          The OGLE Collection of Variable Stars: Over 18 000 Rotating Variables toward the Galactic Bulge", "authors": "P. Iwanek, I. Soszyński, K. Stępień, S. Kozłowski, J. Skowron, A. Udalski, M. K. Szymański, M. Wrona, P. Pietrukowicz, R. Poleski, P. Mróz, K. Ulaczyk, D. M. Skowron, M. Gromadzki, K. Rybicki, M. J. Mróz, M. Ratajczak", "subjects": "Subjects:\nSolar and Stellar Astrophysics (astro-ph.SR); Astrophysics of Galaxies (astro-ph.GA)", "abstract": "Stellar rotation, a key factor influencing stellar structure and evolution, also drives magnetic activity, which is manifested as spots or flares on stellar surface. Here, we present a collection of 18 443 rotating variables located toward the Galactic bulge, identified in the photometric database of the Optical Gravitational Lensing Experiment (OGLE) project. These stars exhibit distinct magnetic activity, including starspots and flares. With this collection, we provide long-term, time-series photometry in Cousins I- and Johnson V-band obtained by OGLE since 1997, and basic observational parameters, i.e., equatorial coordinates, rotation periods, mean brightness, and brightness amplitudes in both bands. This is a unique dataset for studying stellar magnetic activity, including activity cycles."}
{"main_page": "https://arxiv.org/abs/", "pdf": "https://arxiv.org/pdf/", "title": "Title:\n          Chandra detects low-luminosity AGN with $M_\\mathrm{BH}=10^{4}-10^{6}~M_\\mathrm{\\odot}$ in nearby ($z<0.5$), dwarf and star-forming galaxies", "authors": "Mainak Singha, Julissa Sarmiento, Sangeeta Malhotra, James E. Rhoads, L. Y. Aaron Yung, Junxian Wang, Zhen-Ya Zheng, Ruqiu Lin, Keunho Kim, Jialai Kang, Santosh Harish", "subjects": "Subjects:\nAstrophysics of Galaxies (astro-ph.GA)", "abstract": "We searched the Chandra and XMM archives for observations of 900 green pea galaxies to find AGN signatures. Green peas are low-mass galaxies with prominent emission lines, similar in size and star formation rate to high-redshift dwarf galaxies. Of the 29 observations found, 9 show X-ray detections with $S/N>3$. The 2-10 keV X-ray luminosity for these 9 sources exceeds $10^{40}~\\mathrm{erg~s}^{-1}$, with 2 sources exceeding $10^{41}~\\mathrm{erg~s}^{-1}$, suggesting the presence of intermediate-mass black holes (IMBH) or low-luminosity AGN (LLAGN) with BH masses between $100-10^6M_\\mathrm{\\odot}$. All X-ray detected sources (plus 6 additional sources) show He~II$\\lambda4686$ emission and a broad component of the H$\\alpha$ emission line, indicating winds. The line widths of the broad H$\\alpha$ and He II$\\lambda4686$ emitting gas clouds are weakly correlated ($R^{2}=0.15$), suggesting He II$\\lambda4686$ emission is inconsistent with winds from super-Eddington accretors. However, the ratio of X-ray luminosity to star formation rate shows an anti-correlation with metallicity in 5 out of 9 X-ray detected sources, implying ultraluminous X-ray sources are key contributors to the observed X-ray luminosity. This could be due to super-Eddington accretors or IMBH. The X-ray emission is much higher than that produced by Wolf-Rayet stars and supernovae-driven winds. Thus, the X-ray luminosity in these 9 sources can only be explained by black holes with masses over $100~M_\\mathrm{\\odot}$. Our findings suggest the presence of LLAGN in these galaxies, with broad H$\\alpha$ line widths implying BH masses of $10^4-10^6M_\\mathrm{\\odot}$. Given Green Peas' role as significant Lyman Continuum leakers, LLAGN in these galaxies could have contributed significantly to cosmic reionization."}
{"main_page": "https://arxiv.org/abs/", "pdf": "https://arxiv.org/pdf/", "title": "Title:\n          Digging deeper into the dense Galactic globular cluster Terzan 5 with Electron-Multiplying CCDs. Variable star detection and new discoveries", "authors": "R. Figuera Jaimes, M. Catelan, K. Horne, J. Skottfelt, C. Snodgrass, M. Dominik, U. G. Jørgensen, J. Southworth, M. Hundertmark, P. Longa-Peña, S. Sajadian, J. Tregolan-Reed, T. C. Hinse, M. I. Andersen, M. Bonavita, V. Bozza, M. J. Burgdorf, L. Haikala, E. Khalouei, H. Korhonen, N. Peixinho, M. Rabus, S. Rahvar", "subjects": "Subjects:\nSolar and Stellar Astrophysics (astro-ph.SR); Astrophysics of Galaxies (astro-ph.GA)", "abstract": "Context. High frame-rate imaging was employed to mitigate the effects of atmospheric turbulence (seeing) in observations of globular cluster Terzan 5. Aims. High-precision time-series photometry has been obtained with the highest angular resolution so far taken in the crowded central region of Terzan 5, with ground-based telescopes, and ways to avoid saturation of the brightest stars in the field observed. Methods. The Electron-Multiplying Charge Coupled Device (EMCCD) camera installed at the Danish 1.54-m telescope at the ESO La Silla Observatory was employed to produce thousands of short-exposure time images (ten images per second) that were stacked to produce the normal-exposure-time images (minutes). We employed difference image analysis in the stacked images to produce high-precision photometry using the DanDIA pipeline. Results. Light curves of 1670 stars with 242 epochs were analyzed in the crowded central region of Terzan 5 to statistically detect variable stars in the field observed. We present a possible visual counterpart outburst at the position of the pulsar J1748-2446N, and the visual counterpart light curve of the low-mass X-ray binary CX 3. Additionally, we present the discovery of 4 semiregular variables. We also present updated ephemerides and properties of the only RR Lyrae star previously known in the field covered by our observations in Terzan 5. Finally, we report a significant displacement of two sources by ~0.62 and 0.59 arcseconds with respect to their positions in previous images available in the literature."}
{"main_page": "https://arxiv.org/abs/", "pdf": "https://arxiv.org/pdf/", "title": "Title:\n          Active Galaxy Science with the Line Emission Mapper: The Case for High-Resolution Soft X-ray Spectroscopy", "authors": "Kimberly A. Weaver, Jenna M. Cann, Ryan W. Pfeifle, Malgorzata Sobolewska, Ciro Pinto, Mojegan Azadi, Delphine Porquet, Priyanka Chakraborty, Daniele Rogantini, Gerrit Schellenberger, Ryan Tanner, Simona Mei, Akos Bogdan, Dustin Nguyen", "subjects": "Subjects:\nHigh Energy Astrophysical Phenomena (astro-ph.HE); Astrophysics of Galaxies (astro-ph.GA)", "abstract": "This white paper discusses the breadth of science related to active galactic nuclei (AGN) and associated phenomena to be enabled by a mission with microcalorimeter energy resolution in the soft X-ray band, a large collecting area, and wide-field imaging. Such a mission, the Line Emission Mapper (LEM), has been proposed to NASA's 2023 Astrophysics Probe Explorer call. While the science pillars of the PI-led part of the mission focus on galaxy evolution, the PI-led LEM All-Sky Survey (LASS) and General Observer/Investigator opportunities will enable vital discoveries for AGN science in the critical soft X-ray band."}
{"main_page": "https://arxiv.org/abs/", "pdf": "https://arxiv.org/pdf/", "title": "Title:\n          Curved detectors for future X-ray astrophysics missions", "authors": "Eric D. Miller (1), James A. Gregory (2), Marshall W. Bautz (1), Harry R. Clark (2), Michael Cooper (2), Kevan Donlon (2), Richard F. Foster (1), Catherine E. Grant (1), Mallory Jensen (2), Beverly LaMarr (1), Renee Lambert (2), Christopher Leitz (2), Andrew Malonis (1), Mo Neak (2), Gregory Prigozhin (1), Kevin Ryu (2), Benjamin Schneider (1), Keith Warner (2), Douglas J. Young (2), William W. Zhang (3) ((1) Kavli Institute for Astrophysics and Space Research, Massachusetts Institute of Technology, (2) Lincoln Laboratory, Massachusetts Institute of Technology, (3) NASA Goddard Space Flight Center)", "subjects": "Subjects:\nInstrumentation and Methods for Astrophysics (astro-ph.IM); High Energy Astrophysical Phenomena (astro-ph.HE)", "abstract": "Future X-ray astrophysics missions will survey large areas of the sky with unparalleled sensitivity, enabled by lightweight, high-resolution optics. These optics inherently produce curved focal surfaces with radii as small as 2 m, requiring a large area detector system that closely conforms to the curved focal surface. We have embarked on a project using a curved charge-coupled device (CCD) detector technology developed at MIT Lincoln Laboratory to provide large-format, curved detectors for such missions, improving performance and simplifying design. We present the current status of this work, which aims to curve back-illuminated, large-format (5 cm x 4 cm) CCDs to 2.5-m radius and confirm X-ray performance. We detail the design of fixtures and the curving process, and present intial results on curving bare silicon samples and monitor devices and characterizing the surface geometric accuracy. The tests meet our accuracy requirement of <5 $\\mu$m RMS surface non-conformance for samples of similar thickness to the functional detectors. We finally show X-ray performance measurements of planar CCDs that will serve as a baseline to evaluate the curved detectors. The detectors exhibit low noise, good charge-transfer efficiency, and excellent, uniform spectroscopic performance, including in the important soft X-ray band."}
{"main_page": "https://arxiv.org/abs/", "pdf": "https://arxiv.org/pdf/", "title": "Title:\n          Rapid Response Mode observations of GRB 160203A: Looking for fine-structure line variability at z=3.52", "authors": "G. Pugliese, A. Saccardi, V. D Elia, S. D. Vergani, K. E. Heintz, S. Savaglio, L. Kaper, A. de Ugarte Postigo, D. H. Hartmann, A. De Cia, S. Vejlgaard, J. P. U. Fynbo, L. Christensen, S. Campana, D. van Rest, J. Selsing, K. Wiersema, D. B. Malesani, S. Covino, D. Burgarella, M. De Pasquale, P. Jakobsson, J. Japelj, D. A. Kann, C. Kouveliotou, A. Rossi, N. R. Tanvir, C. C. Thoene, D. Xu", "subjects": "Subjects:\nHigh Energy Astrophysical Phenomena (astro-ph.HE); Astrophysics of Galaxies (astro-ph.GA)", "abstract": "Gamma-ray bursts are the most energetic known explosions. Despite fading rapidly, they allow to measure redshift and important properties of their host-galaxies. We report the photometric and spectroscopic study of GRB 160203A and its host-galaxy. Fine-structure absorption lines, detected in the afterglow at different epochs, allow us to investigate variability due to the strong fading background source. We obtained two optical to near-infrared spectra of the afterglow with X-shooter on ESO/VLT, 18 min and 5.7 hrs after the burst, allowing us to investigate temporal changes of fine-structure absorption lines. We measured HI column density log N(HI/cm-2)=21.75+/-0.10, and several heavy-element ions along the GRB sight-line in the host-galaxy: SiII,AlII,AlIII,CII,NiII,SiIV,CIV,ZnII,FeII, and FeII and SiII fine structure transitions from energetic levels excited by the afterglow, at a redshift z=3.518. We measured [M/H]TOT=-0.78+/-0.13 and [Zn/Fe]FIT=0.69+/-0.15, representing the total(dust-corrected) metallicity and dust depletion, respectively. We detected additional intervening systems along the line of sight at z=1.03,z=1.26,z=1.98,z=1.99,z=2.20 and z=2.83. We could not measure significant variability in the fine-structure lines throughout all the observations and determined an upper limit for the GRB distance from the absorber of d<300 pc, adopting the canonical UV pumping scenario. However, we note that the quality of our data is not sufficient to conclusively rule out collisions as an alternative mechanism. GRB 160203A belongs to a growing sample of GRBs with medium resolution spectroscopy, provided by the Swift/X-shooter legacy program, which enables detailed investigation of the interstellar medium in high-redshift GRB host-galaxies. In particular, this host galaxy shows relatively high metal enrichment and dust depletion already in place when the universe was only 1.8 Gyr old."}
{"main_page": "https://arxiv.org/abs/", "pdf": "https://arxiv.org/pdf/", "title": "Title:\n          Tidal tails of open clusters", "authors": "Janez Kos", "subjects": "Subjects:\nAstrophysics of Galaxies (astro-ph.GA); Solar and Stellar Astrophysics (astro-ph.SR)", "abstract": "Context. Open clusters that emerged from the star forming regions as gravitationally bound structures are subjected to star evaporation, ejection, and tidal forces throughout the rest of their lives. Consequently they form tidal tails that can stretch kiloparsecs along the cluster's orbit. Aims. Cluster members are typically found by searching for overdensities in some parameter space (positions and velocities or sometimes actions and orbital parameters of stars). However, this method is not effective in identifying stars located in the tidal tails far from the open cluster cores. We present a probabilistic method for finding distant cluster members without relying on searching for overdensities and apply it to 476 open clusters. Methods. First, we simulate the dissolution of a cluster and obtain a probability distribution (likelihood) describing where cluster members are to be found. The distribution of stars from the Gaia DR3 catalogue in high likelihood regions is then compared to the simulated stellar population of the Galaxy to define the membership probability of each star. Results. The survey of cluster members included all stars with a magnitude of G < 17.5 and larger clusters with an age of > 100 Myr within 3 kpc from the Sun. We successfully find stars with high membership probabilities in the tidal tails of most clusters, stretching more than a kiloparsec from the cluster cores in some cases. We analyse the morphological properties of tidal tails, demonstrate how properly normalised membership probabilities aid systematic studies of open clusters and publish a catalogue of stars found in the tidal tails."}
{"main_page": "https://arxiv.org/abs/", "pdf": "https://arxiv.org/pdf/", "title": "Title:\n          Probing the cosmic web in Ly$\\alpha$ emission over large scales: an Intensity Mapping forecast for DECaLS/BASS and DESI", "authors": "Pablo Renard, Daniele Spinoso, Zechang Sun, Hu Zou, Paulo Montero-Camacho, Zheng Cai", "subjects": "Subjects:\nCosmology and Nongalactic Astrophysics (astro-ph.CO)", "abstract": "Being the most prominent HI line, Ly$\\alpha$ permeates the cosmic web in emission. Despite its potential as a cosmological probe, its detection on large scales remains elusive. We present a new methodology to perform Ly$\\alpha$ intensity mapping with broad-band optical images, by cross-correlating them with Ly$\\alpha$ forest data using a custom one-parameter estimator. We also develop an analytical large-scale Ly$\\alpha$ emission model with two parameters (average luminosity $\\langle L_{\\rm Ly\\alpha} \\rangle$ and bias $b_{\\rm e}$) that respects observational constraints from QSO luminosity functions. We compute a forecast for DECaLS/BASS $g$-band images cross-correlated with DESI Ly$\\alpha$ forest data, setting guidelines for reducing images into Ly$\\alpha$ intensity maps. Given the transversal scales of our cross-correlation (26.4 arcmin, $\\sim$33 cMpc/h), our study effectively integrates Ly$\\alpha$ emission over all the cosmic volume inside the DESI footprint at $2.2 < z < 3.4$ (the $g$-band Ly$\\alpha$ redshift range). Over the parameter space ($\\langle L_{\\rm Ly\\alpha} \\rangle$, $b_{\\rm e}$) sampled by our forecast, we find a 3$\\sigma$ of large-scale structure in Ly$\\alpha$ likely, with a probability of detection of 23.95\\% for DESI-DECaLS/BASS, and 54.93\\% for a hypothetical DESI phase II with twice as much Ly$\\alpha$ QSOs. Without a detection, we derive upper bounds on $\\langle L_{\\rm Ly\\alpha} \\rangle$ competitive with optimistic literature estimates ($2.3 \\pm 1 \\cdot 10^{\\rm 41}$ erg/s/cMpc$^3$ for DESI, and $\\sim$35\\% lower for its hypothetical phase II). Extrapolation to the DESI-Rubin overlap shows that a detection of large-scale structure with Ly$\\alpha$ intensity mapping using next-generation imaging surveys is certain. [abridged]"}
{"main_page": "https://arxiv.org/abs/", "pdf": "https://arxiv.org/pdf/", "title": "Title:\n          Insights into Gravitinos Abundance, Cosmic Strings and Stochastic Gravitational Wave Background", "authors": "K. El Bourakadi, G. Otalora, A. Burton-Villalobos, H. Chakir, M. Ferricha-Alami, M. Bennai", "subjects": "Subjects:\nCosmology and Nongalactic Astrophysics (astro-ph.CO); General Relativity and Quantum Cosmology (gr-qc); High Energy Physics - Theory (hep-th)", "abstract": "In this paper, we investigate D-term inflation within the framework of supergravity, employing the minimal Kahler potential. Our study reveals that this model can overcome the {\\eta}-problem found in F-term models. Additionally, we explore reheating dynamics and gravitino production, emphasizing the interplay between reheating temperature, spectral index, and gravitino abundance. Our analysis indicates that gravitino production is sensitive to the equation of state during reheating, affecting the reheating temperature and subsequent dark matter relic density. Perturbation theory reveals that Primordial Gravitational Waves (PGWs) evolve according to second-order effects arising from first-order curvature perturbations. In fact, the spectral energy density of these waves is particularly relevant to Pulsar Timing Array (PTA) observations. Furthermore, we analyze gravitational waves generated by cosmic strings, providing critical constraints on early Universe dynamics and cosmic string properties. The dimensionless string tension significantly influences the stochastic gravitational wave background (SGWB) produced by cosmic strings post-inflation. Finally, the stochastic gravitational wave background (SGWB) produced by cosmic strings is influenced by the energy scales of inflation and string formation."}
{"main_page": "https://arxiv.org/abs/", "pdf": "https://arxiv.org/pdf/", "title": "Title:\n          Upshifted frequency of electromagnetic plasma waves due to reflecting gravitational waves acting as almost-luminal mirrors", "authors": "Felipe A. Asenjo, Swadesh M. Mahajan", "subjects": "Subjects:\nHigh Energy Astrophysical Phenomena (astro-ph.HE)", "abstract": "We show that dispersive gravitational waves, as a background spacetime, can reflect electromagnetic waves in a plasma. This reflection upshifts the frequency of the reflected wave, being larger for low-frequency incident waves. This effect takes place when the gravitational wave background propagates almost at the speed of light, allowing it to behave similar to a luminal mirror to electromagnetic plasma waves."}
{"main_page": "https://arxiv.org/abs/", "pdf": "https://arxiv.org/pdf/", "title": "Title:\n          Eccentricity and Inclination of Massive Planets Inside Low-density Cavities: Results of 3D Simulations", "authors": "M. M. Romanova, A. V. Koldoba, G. V. Ustyugova, C. Espaillat, R. V. E. Lovelace", "subjects": "Subjects:\nEarth and Planetary Astrophysics (astro-ph.EP)", "abstract": "We study the evolution of eccentricity and inclination of massive planets in low-density cavities of protoplanetary discs using three-dimensional (3D) simulations. When the planet's orbit is aligned with the equatorial plane of the disc, the eccentricity increases to high values of 0.7-0.9 due to the resonant interaction with the inner parts of the disc. For planets on inclined orbits, the eccentricity increases due to the Kozai-Lidov mechanism, where the disc acts as an external massive body that perturbs the planet's orbit. At small inclination angles, < 30 degrees, the resonant interaction with the inner disc strongly contributes to the eccentricity growth, while at larger angles, eccentricity growth is mainly due to the Kozai-Lidov mechanism. We conclude that planets inside low-density cavities tend to acquire high eccentricity if favorable conditions give sufficient time for growth. The final value of the planet's eccentricity, after the disc dispersal depends on the planet's mass and properties of the cavity and protoplanetary disc."}
{"main_page": "https://arxiv.org/abs/", "pdf": "https://arxiv.org/pdf/", "title": "Title:\n          Galaxies Ages with Redshift z=2 to 4: Stellar Population Synthesis for Candidates in FourStar Galaxy Evolution Survey", "authors": "Chong-yu Gao, Martin Lopez-Corredoira, Jun-jie Wei", "subjects": "Subjects:\nAstrophysics of Galaxies (astro-ph.GA)", "abstract": "Observations of large amount of massive galaxies with relatively old populations found at high redshifts are challenging galaxy formation scenarios within standard cosmology. Precise determinations of the average age of these galaxies would be useful for the discussion of this problem. Here we carry out a better constraint of the age of 200 V-shaped SED non-AGN galaxies at redshifts $2<z<4$ of the catalog of FourStar Galaxy Evolution Survey, identified by V-shape in their spectral energy distribution (SED) with a Lyman and a Balmer break. SED fitting include a main stellar population in addition to a residual younger population and extinction. The galaxies are younger at higher redshift on average. However, for the galaxies with $z>2.5$, we do not see a significant evolution of their average age, with all average ages of galaxies mostly remaining between 1 and 2 Gyr. Our research find that most massive galaxies ($\\sim 10^{10} M_\\odot$ ) are older (typically $>\\sim 1$ Gyr old) and formed earlier than less massive galaxies in our sample."}
{"main_page": "https://arxiv.org/abs/", "pdf": "https://arxiv.org/pdf/", "title": "Title:\n          The space coronagraph optical bench (SCoOB): 4. vacuum performance of a high contrast imaging testbed", "authors": "Kyle Van Gorkom, Ewan S Douglas, Kian Milani, Jaren N Ashcraft, Ramya M Anche, Emory Jenkins, Patrick Ingraham, Sebastiaan Haffert, Daewook Kim, Heejoo Choi, Olivier Durney", "subjects": "Subjects:\nInstrumentation and Methods for Astrophysics (astro-ph.IM)", "abstract": "The Space Coronagraph Optical Bench (SCoOB) is a high-contrast imaging testbed built to demonstrate starlight suppression techniques at visible wavelengths in a space-like vacuum environment. The testbed is designed to achieve ${<}10^{-8}$ contrast from $3-10\\lambda/D$ in a one-sided dark hole using a liquid crystal vector vortex waveplate and a 952-actuator Kilo-C deformable mirror (DM) from Boston Micromachines (BMC). We have recently expanded the testbed to include a field stop for mitigation of stray/scattered light, a precision-fabricated pinhole in the source simulator, a Minus K passive vibration isolation table for jitter reduction, and a low-noise vacuum-compatible CMOS sensor. We report the latest contrast performance achieved using implicit electric field conjugation (iEFC) at a vacuum of ${\\sim}10^{-6}$ Torr and over a range of bandpasses with central wavelengths from 500 to 650nm and bandwidths (BW) from $\\ll 1\\%$ to 15\\%. Our jitter in vacuum is $<3\\times10^{-3} \\lambda/D$, and the best contrast performance to-date in a half-sided D-shaped dark hole is $2.2\\times10^{-9}$ in a $\\ll 1 \\%$ BW, $4\\times10^{-9}$ in a 2\\% BW, and $2.5\\times10^{-8}$ in a 15\\% BW."}
{"main_page": "https://arxiv.org/abs/", "pdf": "https://arxiv.org/pdf/", "title": "Title:\n          The Space Coronagraph Optical Bench (SCoOB): 5. End-to-end simulations of polarization aberrations", "authors": "Ramya M Anche, Kyle J. Van Gorkom, Jaren N. Ashcraft, Ewan Douglas, Emory L Jenkins, Sebastiaan Y. Haffert, Maxwell A. Millar-Blanchaer", "subjects": "Subjects:\nInstrumentation and Methods for Astrophysics (astro-ph.IM); Earth and Planetary Astrophysics (astro-ph.EP)", "abstract": "Polarization aberrations originating from the telescope and high-contrast imaging instrument optics introduce polarization-dependent speckles and associated errors in the image plane, affecting the measured exoplanet signal. Understanding this effect is critical for future space-based high-contrast imaging instruments that aim to image the Earth analogs with 1e-10 raw contrast and characterize their atmospheres. We present end-to-end modeling of the polarization aberrations for a high-contrast imaging testbed, SCoOB. We use a vector vortex coronagraph (VVC) as the focal plane mask, incorporate polarization filtering, and estimate the peak contrast in the dark hole region. The dominant polarization aberrations in the system are retardance defocus and tilt due to the OAPs and fold mirrors. Although the mean contrast in the dark hole region remains unaffected by the polarization aberrations, we see brighter speckles limiting the contrast to 1e-9 at smaller inner working angles. We extend the simulations using the measured retardance maps for the VVC. We find that the mean contrast in SCoOB is more sensitive to the VVC and the QWP retardance errors than the polarization aberrations."}
{"main_page": "https://arxiv.org/abs/", "pdf": "https://arxiv.org/pdf/", "title": "Title:\n          Cloud Crushing and Dissipation of Uniformly-Driven Adiabatic Turbulence in Circumgalactic Media", "authors": "Alex Lv, Lile Wang, Renyue Cen, Luis C. Ho", "subjects": "Subjects:\nAstrophysics of Galaxies (astro-ph.GA); Cosmology and Nongalactic Astrophysics (astro-ph.CO)", "abstract": "The circumgalactic medium (CGM) is responsive to kinetic disruptions generated by nearby astrophysical events. In this work, we study the saturation and dissipation of turbulent hydrodynamics within the CGM through an extensive array of 252 numerical simulations with a large parameter space. These simulations are endowed with proper cooling mechanisms to consistently explore the parameter space spanned by the average gas density, metallicity, and turbulence driving strength. A dichotomy emerges in the dynamics dissipation behaviors. Disturbances that are hot and subsonic are characterized by weak compression and slow dissipation, resulting in density fluctuations typically $\\lesssim 10^{-2}$. Conversely, warm supersonic turbulence, marked by significant compression shocks and subsequent rapid cooling, is associated with substantial clumping factors $\\sim 10^0-10^1$. In the supersonic cases, the kinetic energy decay is divided into a rate-limiting phase of shock dissipation and a comparatively swift phase of thermal dissipation, predominantly occurring within the overdense regions. Upon turbulence driving turnoff, the strong density contrasts decay within a relatively brief timescale of $\\sim 30 - 300~{\\rm Myr}$, depending on the average gas density. Dense clouds are crushed on similar timescales of $ \\sim 30 - 100 ~{\\rm Myr} $, depending on turbulence driving strength but independent from average gas density. Results of this work also contribute a novel dataset of dissipation timescales that incorporates an understanding of kinematics and thermodynamics in addition to the traditional cooling rate tables, which may serve as a valuable asset for forthcoming simulations that aim to explore gas dynamics on galactic and cosmological scales."}
{"main_page": "https://arxiv.org/abs/", "pdf": "https://arxiv.org/pdf/", "title": "Title:\n          The prototypical major cluster merger Abell 754. I. Calibration of MeerKAT data and radio/X-ray spectral mapping of the cluster", "authors": "A. Botteon, R. J. van Weeren, D. Eckert, F. Gastaldello, M. Markevitch, S. Giacintucci, G. Brunetti, R. Kale, T. Venturi", "subjects": "Subjects:\nCosmology and Nongalactic Astrophysics (astro-ph.CO); High Energy Astrophysical Phenomena (astro-ph.HE)", "abstract": "Abell 754 is a rich galaxy cluster at $z=0.0543$ and is considered the prototype of a major cluster merger. Like many dynamically unrelaxed systems, it hosts diffuse radio emission on Mpc-scales. Extended synchrotron sources in the intra-cluster medium (ICM) are commonly interpreted as evidence that a fraction of the gravitational energy released during cluster mergers is dissipated into non-thermal components. Here, we use new MeerKAT UHF- and L-band observations to study non-thermal phenomena in Abell 754. These data are complemented with archival XMM-Newton observations to investigate the resolved spectral properties of both the radio and X-ray cluster emission. For the first time, we employed the pipeline originally developed to calibrate LOFAR data to MeerKAT observations. This allowed us to perform a direction-dependent calibration and obtain highly sensitive radio images in UHF- and L-bands which capture the extended emission with unprecedented detail. By using a large XMM-Newton mosaic, we produced thermodynamic maps of the ICM. Our analysis reveals that the radio halo in the cluster center is bounded by the well-known shock in the eastern direction. Furthermore, in the south-west periphery, we discover an extended radio source that we classify as a radio relic which is possibly tracing a shock driven by the squeezed gas compressed by the merger, outflowing in perpendicular directions. The low-luminosity of this relic appears compatible with direct acceleration of thermal pool electrons. We interpreted the observed radio and X-ray features in the context of a major cluster merger with a non-zero impact parameter. Abell 754 is a remarkable galaxy cluster showcasing exceptional features associated with the ongoing merger event. The high quality of the new MeerKAT data motivates further work on this system."}
{"main_page": "https://arxiv.org/abs/", "pdf": "https://arxiv.org/pdf/", "title": "Title:\n          Dynamical evolution of Milky Way globular clusters on the cosmological timescale I. Mass loss and interaction with the nuclear star cluster", "authors": "M. Ishchenko, P. Berczik, T. Panamarev, D. Kuvatova, M. Kalambay, A. Gluchshenko, O. Veles, M. Sobolenko, O. Sobodar, C. Omarov", "subjects": "Subjects:\nAstrophysics of Galaxies (astro-ph.GA)", "abstract": "Context. Based on the Gaia DR3, we reconstructed the orbital evolution of the known Milky Way globular clusters and found that six objects, NGC 6681, NGC 6981, Palomar 6, NGC 6642, HP 1, and NGC 1904, very likely interact closely with the nuclear star cluster. Aims. We study the dynamical evolution of selected Milky Way globular clusters and their interactions with the Galactic centre over cosmological timescales. We examine the global dynamical mass loss of these globular cluster systems, their close interactions with the Galactic centre, and the potential capture of stars by the Milky Way nuclear star cluster. Methods. For the dynamical modelling of the clusters, we used the parallel N-body code phi-GPU, which allows star-by-star simulations of the systems. Our current code also enabled us to follow the stellar evolution of individual particles, including the formation of high-mass remnants. The modelling was carried out in a Milky Way-like, time-variable potential (with a dynamically changing mass and scale length), obtained from the IllustrisTNG-100 database, with a full integration time of eight billion years. Results. Based on extensive numerical modelling and analysis, we estimated the mass loss and the global and inner structures of the selected six clusters. Over an evolution of eight billion years, the clusters lost 80% of their initial mass. We analysed the phase-space evolution of the individual unbound stars NGC 6681, NGC 6642, HP 1, and NGC 1904. We found that only NGC 6642 could potentially have been a source for populating the Milky Way nuclear star cluster in the past."}
{"main_page": "https://arxiv.org/abs/", "pdf": "https://arxiv.org/pdf/", "title": "Title:\n          Resonant sub-Neptunes are puffier", "authors": "Adrien Leleu, Jean-Baptiste Delisle, Remo Burn, André Izidoro, Stéphane Udry, Xavier Dumusque, Christophe Lovis, Sarah Millholland, Léna Parc, François Bouchy, Vincent Bourrier, Yann Alibert, João Faria, Christoph Mordasini, Damien Ségransan", "subjects": "Subjects:\nEarth and Planetary Astrophysics (astro-ph.EP)", "abstract": "A systematic, population-level discrepancy exists between the densities of exoplanets whose masses have been measured with transit timing variations (TTVs) versus those measured with radial velocities (RVs). Since the TTV planets are predominantly nearly resonant, it is still unclear whether the discrepancy is attributed to detection biases or to astrophysical differences between the nearly resonant and non resonant planet populations. We defined a controlled, unbiased sample of 36 sub-Neptunes characterised by Kepler, TESS, HARPS, and ESPRESSO. We found that their density depends mostly on the resonant state of the system, with a low probability (of $0.002_{-0.001}^{+0.010}$) that the mass of (nearly) resonant planets is drawn from the same underlying population as the bulk of sub-Neptunes. Increasing the sample to 133 sub-Neptunes reveals finer details: the densities of resonant planets are similar and lower than non-resonant planets, and both the mean and spread in density increase for planets that are away from resonance. This trend is also present in RV-characterised planets alone. In addition, TTVs and RVs have consistent density distributions for a given distance to resonance. We also show that systems closer to resonances tend to be more co-planar than their spread-out counterparts. These observational trends are also found in synthetic populations, where planets that survived in their original resonant configuration retain a lower density; whereas less compact systems have undergone post-disc giant collisions that increased the planet's density, while expanding their orbits. Our findings reinforce the claim that resonant systems are archetypes of planetary systems at their birth."}
{"main_page": "https://arxiv.org/abs/", "pdf": "https://arxiv.org/pdf/", "title": "Title:\n          Design and Implementation of a Scalable Correlator Based on ROACH2+GPU Cluster for Tianlai 96-Dual-Polarization Antenna Array", "authors": "Zhao Wang, Ji-Xia Li, Ke Zhang, 1 Feng-Quan Wu, Hai-Jun Tian, Chen-Hui Niu, Ju-Yong Zhang, Zhi-Ping Chen, Dong-Jin Yu, Xue-Lei Chen", "subjects": "Subjects:\nInstrumentation and Methods for Astrophysics (astro-ph.IM)", "abstract": "The digital correlator is one of the most crucial data processing components of a radio telescope array. With the scale of radio interferometeric array growing, many efforts have been devoted to developing a cost-effective and scalable correlator in the field of radio astronomy. In this paper, a 192-input digital correlator with six CASPER ROACH2 boards and seven GPU servers has been deployed as the digital signal processing system for Tianlai cylinder pathfinder located in Hongliuxia observatory. The correlator consists of 192 input signals (96 dual-polarization), 125-MHz bandwidth, and full-Stokes output. The correlator inherits the advantages of the CASPER system, for example, low cost, high performance, modular scalability, and a heterogeneous computing architecture. With a rapidly deployable ROACH2 digital sampling system, a commercially expandable 10 Gigabit switching network system, and a flexible upgradable GPU computing system, the correlator forms a low-cost and easily-upgradable system, poised to support scalable large-scale interferometeric array in the future."}
{"main_page": "https://arxiv.org/abs/", "pdf": "https://arxiv.org/pdf/", "title": "Title:\n          Black Silicon BRDF and Polarization for Coronagraphic Pupil Masks", "authors": "Emory L. Jenkins, Ramya M. Anche, Kyle J. Van Gorkom, A. J. Eldorado Riggs, Ewan S. Douglas", "subjects": "Subjects:\nInstrumentation and Methods for Astrophysics (astro-ph.IM)", "abstract": "Future space observatories will likely have segmented primaries, causing diffraction effects that reduce coronagraph performance. Reflective binary pupil apodizer masks can mitigate these, with the metamaterial black silicon (BSi) showing promise as a strong absorber. To bring contrast ratios to the $10^-{10}$ level as needed to observe Earth-like exoplanets, feature sizes on these BSi masks will need to be less than $5$ microns when paired with MEMS (micro-electromechanical systems) deformable mirrors. As scalar diffraction cannot reliably model this feature size, we developed a Finite-Difference Time-Domain (FDTD) model of BSi masks using Meep software. We characterize the FDTD-derived polarization-dependent bidirectional reflectance distribution function of BSi and discuss the model's shortcomings."}
{"main_page": "https://arxiv.org/abs/", "pdf": "https://arxiv.org/pdf/", "title": "Title:\n          Predicting the Non-Thermal Pressure in Galaxy Clusters", "authors": "Andrew Sullivan, Stanislav Shabala, Chris Power, Connor Bottrell, Aaron Robotham", "subjects": "Subjects:\nAstrophysics of Galaxies (astro-ph.GA)", "abstract": "We investigate the relationship between a galaxy cluster's hydrostatic equilibrium state, the entropy profile, $K$, of the intracluster gas, and the system's non-thermal pressure (NTP), within an analytic model of cluster structures. When NTP is neglected from the cluster's hydrostatic state, we find that the gas' logarithmic entropy slope, $k\\equiv \\mathrm{d}\\ln K/\\mathrm{d}\\ln r$, converges at large halocentric radius, $r$, to a value that is systematically higher than the value $k\\simeq1.1$ that is found in observations and simulations. By applying a constraint on these `pristine equilibrium' slopes, $k_\\mathrm{eq}$, we are able to predict the required NTP that must be introduced into the hydrostatic state of the cluster. We solve for the fraction, $\\mathcal{F}\\equiv p_\\mathrm{nt}/p$, of NTP, $p_\\mathrm{nt}$, to total pressure, $p$, of the cluster, and we find $\\mathcal{F}(r)$ to be an increasing function of halocentric radius, $r$, that can be parameterised by its value in the cluster's core, $\\mathcal{F}_0$, with this prediction able to be fit to the functional form proposed in numerical simulations. The minimum NTP fraction, as the solution with zero NTP in the core, $\\mathcal{F}_0=0$, we find to be in excellent agreement with the mean NTP predicted in non-radiative simulations, beyond halocentric radii of $r\\gtrsim0.7r_{500}$, and in tension with observational constraints derived at similar radii. For this minimum NTP profile, we predict $\\mathcal{F}\\simeq0.20$ at $r_{500}$, and $\\mathcal{F}\\simeq0.34$ at $2r_{500}$; this amount of NTP leads to a hydrostatic bias of $b\\simeq0.12$ in the cluster mass $M_{500}$ when measured within $r_{500}$. Our results suggest that the NTP of galaxy clusters contributes a significant amount to their hydrostatic state near the virial radius, and must be accounted for when estimating the cluster's halo mass using hydrostatic equilibrium approaches."}
{"main_page": "https://arxiv.org/abs/", "pdf": "https://arxiv.org/pdf/", "title": "Title:\n          Extended GeV $\\gamma$-ray emission around the star forming region of the W3 complex", "authors": "Qihang Wu, Xiaona Sun, Ruizhi Yang, Tingting Ge, Yunfeng Liang, Enwei Liang", "subjects": "Subjects:\nHigh Energy Astrophysical Phenomena (astro-ph.HE)", "abstract": "We analyze the GeV $\\gamma$-ray emission from the W3 complex using about 14 years of Pass 8 data recorded by the $\\it Fermi$ Large Area Telescope (\\textit{Fermi}-LAT). We resolve the $\\gamma$-ray emissions around W3 into two components: an elliptical Gaussian overlapping with the molecular gas and a point-like source near the cluster W3 Main. The pion-bump feature of SED for the elliptical Gaussian together with the better fitting result of pion decay model favor the hadronic origin. We further argue that the cosmic rays (CRs) could originate from the interactions between cluster winds and the shock produced by the SNR HB3. The point-like source positionally coincident with the star cluster W3 Main indicates it may be directly powered by near clusters, while its fainter $\\gamma$-ray emissions below 10 GeV is possibly due to the shelter from dense gas making the low-energy CRs incapable of penetrating the dense materials. Meanwhile, we cannot rule out that the $\\gamma$-ray emissions originate from the interaction of accelerated protons in SNR with the ambient gas."}
{"main_page": "https://arxiv.org/abs/", "pdf": "https://arxiv.org/pdf/", "title": "Title:\n          A Star Cluster Population of High Mass Black Hole Mergers in Gravitational Wave Data", "authors": "Fabio Antonini, Isobel M. Romero-Shaw, Thomas Callister", "subjects": "Subjects:\nHigh Energy Astrophysical Phenomena (astro-ph.HE); Solar and Stellar Astrophysics (astro-ph.SR)", "abstract": "Stellar evolution theories predict a gap in the black hole birth mass spectrum as the result of pair instability processes in the cores of massive stars. This gap, however, is not seen in the binary black hole masses inferred from gravitational wave data. One explanation is that black holes form dynamically in dense star clusters where smaller black holes merge to form more massive black holes, populating the mass gap. We show that this model predicts a distribution of the effective and precessing spin parameters, $\\chi_{\\rm eff}$ and $\\chi_{\\rm p}$, within the mass gap that is insensitive to assumptions about black hole natal spins. We analyze the distribution of $\\chi_{\\rm eff}$ as a function of primary mass for the black hole binaries in the third gravitational wave transient catalog. We infer the presence of a high-mass population of black holes that is consistent with hierarchical formation in dense star clusters. This population becomes dominant above $44^{+6}_{-4} M_\\odot$, which we interpret as the lower edge of the pair-instability mass gap. Upcoming data will enable us to tightly constrain the hierarchical formation hypothesis and refine our understanding of binary black hole formation."}
{"main_page": "https://arxiv.org/abs/", "pdf": "https://arxiv.org/pdf/", "title": "Title:\n          A halo model approach to describe clustering and emission of the two main star forming galaxy populations for Cosmic Infrared Background studies", "authors": "Giorgia Zagatti, Erminia Calabrese, Caterina Chiocchetta, Martina Gerbino, Mattia Negrello, Luca Pagano", "subjects": "Subjects:\nCosmology and Nongalactic Astrophysics (astro-ph.CO)", "abstract": "The Cosmic Infrared Background (CIB), traced by the emission from dusty star-forming galaxies, provides a crucial window into the phases of star formation throughout cosmic history. These galaxies, although challenging to detect individually at high redshifts due to their faintness, cumulatively contribute to the CIB which then becomes a powerful probe of galaxy formation, evolution and clustering. Here, we introduce a physically-motivated model for the CIB emission spanning a wide range of frequency and angular resolution, employing a halo model approach and distinguishing, within dark matter halos, between two main populations of star forming galaxies, i.e. normal late-type spiral and irregular galaxies and the progenitors of early-type galaxies. The emission from two galaxy populations maps into different regimes in frequency/resolution space, allowing us to constrain the clustering parameters of the model - $M_{\\text{min}}$, the mass of a halo with 50% probability of having a central galaxy and $\\alpha$, the power law index regulating the number of satellite galaxies - through a fit to Planck and Herschel-SPIRE CIB anisotropy measurements. We find that, while being able to place constraints on some of the clustering parameters, the Planck frequency and multipole coverage cannot effectively disentangle the contributions from the two galaxy populations. On the other side, the Herschel-SPIRE measurements separate out and constrain the clustering of both populations. Our work, though, highlights an inconsistency of the results between the two datasets, partially already reported in other literature and still not understood."}
{"main_page": "https://arxiv.org/abs/", "pdf": "https://arxiv.org/pdf/", "title": "Title:\n          Hybrid approach predicts a lower binding energy for benzene on water ice", "authors": "Victoria H.J. Clark, David M. Benoit, Marie Van de Sande, Catherine Walsh", "subjects": "Subjects:\nEarth and Planetary Astrophysics (astro-ph.EP); Astrophysics of Galaxies (astro-ph.GA); Solar and Stellar Astrophysics (astro-ph.SR); Chemical Physics (physics.chem-ph)", "abstract": "In this paper we provide a highly accurate value for the binding energy of benzene to proton-ordered crystalline water ice (XIh), as a model for interstellar ices. We compare our computed value to the latest experimental data available from temperature programmed desorption (TPD) experiments and find that our binding energy value agrees well with data obtained from binding to either crystalline or amorphous ice. Importantly, our new value is lower than that used in most astrochemical networks by about nearly half its value. We explore the impact of this revised binding energy value for both an AGB outflow and a protoplanetary disk. We find that the lower value of the binding energy predicted here compared with values used in the literature (4050 K versus 7587 K) leads to less depletion of gas-phase benzene in an AGB outflow, and leads to a shift outwards in the benzene snowline in the midplane of a protoplanetary disk. Using this new value, the AGB model predicts lower abundances of benzene in the solid phase throughout the outflow. The disk model also predicts a larger reservoir of gas-phase benzene in the inner disk, which is consistent with the recent detections of benzene for the first time in protoplanetary disks with JWST."}
{"main_page": "https://arxiv.org/abs/", "pdf": "https://arxiv.org/pdf/", "title": "Title:\n          FiberPol-6D: Spectropolarimetric Integral Field mode for the SAAO 1.9 m Telescope using fibers", "authors": "Siddharth Maharana, Sabyasachi Chattopadhyay, Matthew Bershady", "subjects": "Subjects:\nInstrumentation and Methods for Astrophysics (astro-ph.IM); Instrumentation and Detectors (physics.ins-det)", "abstract": "Most optical spectropolarimeters built to date operate as long-slit or point-source instruments; they are inefficient for observations of extended objects such as galaxies and nebulae. 2D spectropolarimetry technique development is a major challenge in astronomical instrumentation. At the South African Astronomical Observatory (SAAO) FiberLab, we are developing a spectropolarimetry capable Integral Field front-end called FiberPol(-6D) for the existing SpUpNIC spectrograph on the SAAO 1.9 m telescope. SpUpNIC is a general purpose 2 arc-minute long-slit spectrograph with a grating suite covering the wavelength range from 350 to 1000 nm and at spectral resolutions between 500 and 6000. FiberPol generates 6D observational data: x-y spatial dimensions, wavelength, and the three linear Stokes parameters $I$, $q$ and $u$. Using a rotating half-wave plate and a Wollaston prism, FiberPol executes two-channel polarimetry, and each channel is fed to an array of 14 fibers, corresponding to a field of view of $10\\times20~arcseconds^2$ sampled with 2.9 arcsecond diameter fiber cores. These fiber arrays are then rerouted to form a pseudo-slit input to SpUpNIC. FiberPol aims to achieve a polarimetric accuracy of 0.1 % per spectral resolution bin. Further, it can also function as a non-polarimetric integral-field unit. The instrument design has been completed and it is currently being assembled and characterized in the lab. It is scheduled for on-sky commissioning in the second half of 2024. In this paper, we present the scientific and technical goals of FiberPol, its overall design and initial results from the lab assembly and testing. FiberPol is a low cost technology demonstrator, and the entire system predominantly employs small size, commercial off-the-shelve optics and optomechanical components. It can be modified and replicated for use on any existing spectrograph, especially on bigger telescopes."}
{"main_page": "https://arxiv.org/abs/", "pdf": "https://arxiv.org/pdf/", "title": "Title:\n          Origin of extended Main Sequence Turn Off in open cluster NGC 2355", "authors": "Jayanand Maurya, M. R. Samal, Louis Amard, Yu Zhang, Hubiao Niu, Sang Chul Kim, Y. C. Joshi, B. Kumar", "subjects": "Subjects:\nSolar and Stellar Astrophysics (astro-ph.SR); Astrophysics of Galaxies (astro-ph.GA)", "abstract": "The presence of extended Main Sequence Turn-Off (eMSTO) in the open clusters has been attributed to various factors, such as spread in rotation rates, binary stars, and dust-like extinction from stellar excretion discs. We present a comprehensive analysis of the eMSTO in the open cluster NGC 2355. Using spectra from the Gaia-ESO archives, we find that the stars in the red part of the eMSTO have a higher mean v sin i value of 135.3$\\pm$4.6 km s$^{-1}$ compared to the stars in the blue part that have an average v sin i equal to 81.3$\\pm$5.6 km s$^{-1}$. This suggests that the eMSTO in NGC 2355 is possibly caused by the spread in rotation rates of stars. We do not find any substantial evidence of the dust-like extinction from the eMSTO stars using ultraviolet data from the Swift survey. The estimated synchronization time for low mass ratio close binaries in the blue part of the eMSTO suggests that they would be mostly slow-rotating if present. However, the stars in the blue part of the eMSTO are preferentially located in the outer region of the cluster indicating that they may lack low mass ratio close binaries. The spread in rotation rates of eMSTO stars in NGC 2355 is most likely caused by the star-disc interaction mechanism. The stars in the lower main sequence beyond the eMSTO region of NGC 2355 are slow-rotating (mean v sin i = 26.5$\\pm$1.3 km s$^{-1}$) possibly due to the magnetic braking of their rotations."}
{"main_page": "https://arxiv.org/abs/", "pdf": "https://arxiv.org/pdf/", "title": "Title:\n          Stability of the Potential Super Jupiter in Alpha Centauri System", "authors": "Tinglong Feng", "subjects": "Subjects:\nEarth and Planetary Astrophysics (astro-ph.EP)", "abstract": "The stability of potential exoplanets in binary star systems remains a critical challenge in celestial mechanics. This study investigates the stability of a hypothetical Jupiter-mass planet in the Alpha Centauri AB system by drawing parallels with the recently detected Neptune-mass planet in the GJ65AB system, which shares similar mass ratios and orbital eccentricities. Utilizing the Kolmogorov-Arnold-Moser (KAM) theorem and the Mean Exponential Growth of Nearby Orbits (MEGNO) parameter within the REBOUND software package, we perform numerical simulations to identify stable orbital configurations. Our results indicate that a Jupiter-mass planet could theoretically maintain a stable orbit in Alpha Centauri AB, with orbital parameters derived from the stable zones observed in GJ65AB. Despite the absence of observational evidence for such a planet in Alpha Centauri AB, this study suggests that similar binary systems could exhibit analogous stability characteristics. Future observational efforts are recommended to explore this potential and refine our understanding of planetary formation in binary star systems."}
{"main_page": "https://arxiv.org/abs/", "pdf": "https://arxiv.org/pdf/", "title": "Title:\n          The Lyman-limit photon mean free path at the end of late reionisation in the Sherwood-Relics simulations", "authors": "Jennifer Feron, Luke Conaboy, James S. Bolton, Emma Chapman, Martin G. Haehnelt, Laura C. Keating, Girish Kulkarni, Ewald Puchwein", "subjects": "Subjects:\nCosmology and Nongalactic Astrophysics (astro-ph.CO)", "abstract": "Recent evidence supporting reionisation ending at redshift z<6 includes the rapid redshift evolution of the mean free path for Lyman-limit photons through the intergalactic medium at 5<z<6. Here we investigate the mean free path predicted by the Sherwood-Relics suite of hybrid radiation hydrodynamical simulations. Simulations with comoving volumes of 40^3 h^-3 cMpc^3 (160^3 h^-3 cMpc^3), calibrated to match the observed Lyman-alpha forest transmission with a late end to reionisation at z<6, are consistent with recent mean free path measurements at z<5.9, and are 1.2\\sigma (1.8\\sigma) above the highest redshift mean free path measurement at z=5.93. The majority of the Lyman-limit opacity at the end of reionisation is attributable to highly ionised Lyman-alpha forest absorbers with neutral hydrogen column densities N_HI=10^16--10^17 cm^-2. Resolving these systems is critical for capturing the redshift evolution of the mean free path during the final stages of reionisation. After reionisation completes, overdense gas will reduce the mean free path by up to 20 per cent around haloes with masses M_h ~ 10^9--10^11 h^-1 M_sol, but during reionisation ionised bubbles will instead boost the mean free path around haloes by up to an order of magnitude when the IGM is as much as 90 per cent neutral by volume. This effect will play an important role in the visibility of Lyman-alpha emitting galaxies at z>10 discovered with JWST."}
{"main_page": "https://arxiv.org/abs/", "pdf": "https://arxiv.org/pdf/", "title": "Title:\n          The case for Centaurus A as the main source of ultrahigh-energy cosmic rays", "authors": "Silvia Mollerach, Esteban Roulet", "subjects": "Subjects:\nHigh Energy Astrophysical Phenomena (astro-ph.HE)", "abstract": "We discuss the possibility that a dominant fraction of the cosmic rays above the ankle is due to a single nearby source, considering in particular the radio galaxy Centaurus A. We focus on the properties of the source spectrum and composition required to reproduce the observations, showing that the nuclei are strongly suppressed for E>10Z EeV, either by a rigidity dependent source cutoff or by the photodisintegration interactions with the CMB at the giant dipole resonance. The very mild attenuation effects at lower energies imply that the secondary nuclei from this source only provide a small contribution. Given the moderate anisotropies observed, the deflections in extragalactic and Galactic magnetic fields should play a crucial role in determining the cosmic ray arrival direction distribution. The diffusion in extragalactic fields as well as the finite source lifetime also significantly affect the shape of the observed spectrum. The cosmic ray flux at tens of EeV is dominated by the CNO component, and we show that it is actually better reproduced by a mixture of C and O nuclei rather than by the usual assumption of a N component effectively describing this mass group. The Si and Fe group components become dominant above 70 EeV, in the energy range in which a strong spectral suppression is present. If the localised flux excess appearing above 40 EeV around the Centaurus A direction is attributed to the CNO component, the He nuclei from the source in the energy range from 10 to 20 EeV could lead to a similar anisotropy unless its contribution is suppressed. The cosmic ray flux at a few EeV should mostly result from a more isotropic light component associated to a population of extragalactic sources. The inclusion of the subdominant contribution of heavy nuclei from the Galactic component helps to reproduce the observations around 1 EeV."}
{"main_page": "https://arxiv.org/abs/", "pdf": "https://arxiv.org/pdf/", "title": "Title:\n          The Maclaurin spheroid in disguise. New figures of equilibrium with external magnetic support", "authors": "Jean-Marc Huré, Clément Staelen", "subjects": "Subjects:\nAstrophysics of Galaxies (astro-ph.GA)", "abstract": "We show that a rigidly rotating, homogeneous ellipsoid of revolution threaded by a uniform, coaxial magnetic field is a possible figure of equilibrium. While the spheroidal shape is fully preserved, the rotation rate is modified. Accordingly, we extend the fundamental formula by Maclaurin. In contrast with the non-magnetic case, prolate shapes are permitted, but there are critical states in the form of maximum elongations, depending on ionisation fraction, ion/electron drift, magnetic field and mass-density. As checked from numerical simulations based on the Self-Consistent-Field method, prolate states survive to gas compressibility. The relevance to interstellar clouds is outlined."}
{"main_page": "https://arxiv.org/abs/", "pdf": "https://arxiv.org/pdf/", "title": "Title:\n          Rotation curves velocities obtained by warm low-density plasma simulating dark halos and dark matter", "authors": "Y. Ben-Aryeh", "subjects": "Subjects:\nAstrophysics of Galaxies (astro-ph.GA)", "abstract": "The free electron model with Boltzmann statistics for spherical low-density plasmas is developed further with asymptotic relations obtaining the density of electrons, mass densities, and the potentials of such plasmas. Solutions are developed as function of a pure number proportional to the distance from the stellar plasma center (galaxy center) with extremely small coefficient, so that these solutions are essentially functions of large astronomical distances and masses. The present plasma is divided into a central part and very long tail, where the central part of the plasma shows an exponential dependence on the distance from the galaxy center, but a part of the large mass of this plasma is included in the long stellar plasma tail. The present model is specialized to completely ionized Hydrogen plasma (with a small correction factor considering its mixture with heavier atoms) where emission and absorption of spectral lines can be neglected in the warm low density stellar plasma. We apply the present approach for treating rotation curves measurements, A general theory for rotation curves should include the superposition of the gravitational potentials introduced by the high-density compact stars, with those of the low-density stellar plasma potentials. But for halos which are at extremely large distance from the galaxy center, the dominant effects would be those of dark matter, and such dark halos are permeating and surrounding the compact galactic stars. Such plasma is found to be transparent in most of the EM spectrum. The existence of a large mass for the warm low-density plasma may solve the problem of missing mass in rotation curves measurements."}
{"main_page": "https://arxiv.org/abs/", "pdf": "https://arxiv.org/pdf/", "title": "Title:\n          Diffuse interstellar bands in the near-infrared: Expanding the reddening range", "authors": "R.Castellanos, F. Najarro, M. Garcia, L. R. Patrick, T. R. Geballe", "subjects": "Subjects:\nAstrophysics of Galaxies (astro-ph.GA)", "abstract": "We have investigated the behaviour of three strong near-infrared diffuse interstellar bands (DIBs) at {\\lambda}13177 Å, {\\lambda}14680 Å, and {\\lambda}15272 Å, on a larger sample of sightlines and over a wider range of extinctions than previously studied, utilizing spectra from three observatories. We applied two telluric correction techniques to reduce atmospheric contamination and have used Gaussian fits to characterise the DIB profiles and measure equivalent widths. We confirmed strong and approximately linear correlations with reddening of the {\\lambda}13177 Å, {\\lambda}14680 Å and {\\lambda}15272 Å DIBs, extending them to higher reddening values and strengthening their link to interstellar matter. Modelling of the {\\lambda}14680 Å DIB profiles revealed intrinsic variations, including line broadening, linked to their formation processes. This effect is particularly pronounced in the Galactic Centre (GC) environment, where multiple diffuse molecular clouds along the line of sight contribute to line broadening. We have detected one new DIB candidate at {\\lambda}14795 Å on sightlines with high reddening."}
{"main_page": "https://arxiv.org/abs/", "pdf": "https://arxiv.org/pdf/", "title": "Title:\n          X-ray and gamma-ray study for 2023 nova eruption of V1716 Sco", "authors": "H.-H. Wang, H.-D. Yan, J. Takata, L.C.-C. Lin", "subjects": "Subjects:\nHigh Energy Astrophysical Phenomena (astro-ph.HE)", "abstract": "We report the results of X-ray and gamma-ray analyses of the nova V1716 Sco taken by Swift, NICER, NuSTAR and F ermi-LAT. We have detected gamma-ray emission at a significant level exceeding 8 {\\sigma} in daily bins starting the day after the optical eruption. The gamma-ray emission, characterized by a Test Statistic (TS) value more than four, persisted for approximately 40 days. Notably, harder X-ray emission were observed by NuSTAR as the start of gamma-ray emission, which is the fourth classical nova that gamma-ray emission is concurrent with harder X-ray emission from NuSTAR data. V1716 Sco is one of rare samples that clearly shows a hard X-ray emission (1-10 keV bands) in the Swift-XRT data concurrently with gamma-ray emission of Fermi-LAT data, and its light curve in 1.0-10.0 keV bands had a peak at about 20 days after the optical eruption. The X-ray spectrum was initially fitted by a model of thermal plasma emission, and entered a supersoft phase with additional blackbody (BB) component emerged around about 40 days after the optical eruption. NICER data taken in supersoft source phase revealed a quasi-periodic oscillation with a period of 79.10+-1.98 seconds, and the peak phase of the folded light curve varied with time. Moreover, V1716 Sco is the another example that the emission radius in supersoft source phase is significantly larger than the radius of white dwarf, and a simple BB emission model may not be applicable since the luminosity exceeds significantly Eddington limit."}
{"main_page": "https://arxiv.org/abs/", "pdf": "https://arxiv.org/pdf/", "title": "Title:\n          A rare, strong shock front in the merging cluster SPT-CL J2031-4037", "authors": "Purva Diwanji, Stephen A. Walker, Mohammad S. Mirakhor", "subjects": "Subjects:\nCosmology and Nongalactic Astrophysics (astro-ph.CO); High Energy Astrophysical Phenomena (astro-ph.HE)", "abstract": "We present our findings from the new deep Chandra observations ($256$ ks) of the merging galaxy cluster SPT-CL J2031-4037 at $z = 0.34$. Our observations reveal intricate structures seen in a major merger akin to the Bullet Cluster. The X-ray data confirm the existence of two shock fronts, one to the northwest and one to the southeast by directly measuring the temperature jump of gas across the surface brightness edges. The stronger shock front in the northwest has a density jump of $3.16 \\pm 0.34$ across the sharp surface brightness edge and Mach number $M = 3.36^{+0.87}_{-0.48}$, which makes this cluster one of the rare merging systems with a Mach number $M > 2$. We use the northwestern shock to compare two models for shock heating - the instant heating model and the Coulomb collisional heating model, and we determine that the temperatures across the shock front agree with the Coulomb collisional model of heating. For the shock front in the southeastern region, we find a density jump of $1.53 \\pm 0.14$ and a Mach number of $M = 1.36 ^{+0.09}_{-0.08}$."}
{"main_page": "https://arxiv.org/abs/", "pdf": "https://arxiv.org/pdf/", "title": "Title:\n          Interacting ultralight dark matter and dark energy and fits to cosmological data in a field theory approach", "authors": "Amin Aboubrahim, Pran Nath", "subjects": "Subjects:\nCosmology and Nongalactic Astrophysics (astro-ph.CO); High Energy Physics - Phenomenology (hep-ph)", "abstract": "The description of dark matter as a pressure-less fluid and of dark energy as a cosmological constant, both minimally coupled to gravity, constitutes the basis of the concordance $\\Lambda\\text{CDM}$ model. However, the concordance model is based on using equations of motion directly for the fluids with constraints placed on their sources, and lacks an underlying Lagrangian. In this work, we propose a Lagrangian model of two spin zero fields describing dark energy and dark matter with an interaction term between the two along with self-interactions. We study the background evolution of the fields as well as their linear perturbations, suggesting an alternative to $\\Lambda$CDM with dark matter and dark energy being fundamental dynamical fields. The parameters of the model are extracted using a Bayesian inference tool based on multiple cosmological data sets which include those of Planck (with lensing), BAO, Pantheon, SH0ES, and WiggleZ. Using these data, we set constraints on the dark matter mass and the interaction strengths. Furthermore, we find that the model is able to alleviate the Hubble tension for some data sets while also resolving the $S_8$ tension."}
{"main_page": "https://arxiv.org/abs/", "pdf": "https://arxiv.org/pdf/", "title": "Title:\n          Mass composition of ultra-high energy cosmic rays from distribution of their arrival directions with the Telescope Array", "authors": "Telescope Array Collaboration: R.U. Abbasi, Y. Abe, T. Abu-Zayyad, M. Allen, Y. Arai, R. Arimura, E. Barcikowski, J.W. Belz, D.R. Bergman, S.A. Blake, I. Buckland, B.G. Cheon, M. Chikawa, T. Fujii, K. Fujisue, K. Fujita, R. Fujiwara, M. Fukushima, G. Furlich, N. Globus, R. Gonzalez, W. Hanlon, N. Hayashida, H. He, R. Hibi, K. Hibino, R. Higuchi, K. Honda, D. Ikeda, N. Inoue, T. Ishii, H. Ito, D. Ivanov, A. Iwasaki, H.M. Jeong, S. Jeong, C.C.H. Jui, K. Kadota, F. Kakimoto, O. Kalashev, K. Kasahara, S. Kasami, S. Kawakami, K. Kawata, I. Kharuk, E. Kido, H.B. Kim, J.H. Kim, J.H. Kim, S.W. Kim, Y. Kimura, I. Komae, V. Kuzmin, M. Kuznetsov, Y.J. Kwon, K.H. Lee, B. Lubsandorzhiev, J.P. Lundquist, H. Matsumiya, T. Matsuyama, J.N. Matthews, R. Mayta, K. Mizuno, M. Murakami, I. Myers, K.H. Lee, S. Nagataki, K. Nakai, T. Nakamura, E. Nishio, T. Nonaka, H. Oda, S. Ogio, M. Onishi, H. Ohoka, N. Okazaki, Y. Oku, T. Okuda, Y. Omura, M. Ono, A. Oshima, H. Oshima, S. Ozawa, I.H. Park, K.Y. Park, M. Potts, M.S. Pshirkov, J. Remington, D.C. Rodriguez, C. Rott, G.I. Rubtsov, D. Ryu, H. Sagawa, R. Saito, N. Sakaki, T. Sako, N. Sakurai, D. Sato, K. Sato", "subjects": "Subjects:\nHigh Energy Astrophysical Phenomena (astro-ph.HE)", "abstract": "We use a new method to estimate the injected mass composition of ultrahigh cosmic rays (UHECRs) at energies higher than 10 EeV. The method is based on comparison of the energy-dependent distribution of cosmic ray arrival directions as measured by the Telescope Array experiment (TA) with that calculated in a given putative model of UHECR under the assumption that sources trace the large-scale structure (LSS) of the Universe. As we report in the companion letter, the TA data show large deflections with respect to the LSS which can be explained, assuming small extra-galactic magnetic fields (EGMF), by an intermediate composition changing to a heavy one (iron) in the highest energy bin. Here we show that these results are robust to uncertainties in UHECR injection spectra, the energy scale of the experiment and galactic magnetic fields (GMF). The assumption of weak EGMF, however, strongly affects this interpretation at all but the highest energies E > 100 EeV, where the remarkable isotropy of the data implies a heavy injected composition even in the case of strong EGMF. This result also holds if UHECR sources are as rare as $2 \\times 10^{-5}$ Mpc$^{-3}$, that is the conservative lower limit for the source number density."}
{"main_page": "https://arxiv.org/abs/", "pdf": "https://arxiv.org/pdf/", "title": "Title:\n          Isotropy of cosmic rays beyond $10^{20}$ eV favors their heavy mass composition", "authors": "Telescope Array Collaboration: R.U. Abbasi, Y. Abe, T. Abu-Zayyad, M. Allen, Y. Arai, R. Arimura, E. Barcikowski, J.W. Belz, D.R. Bergman, S.A. Blake, I. Buckland, B.G. Cheon, M. Chikawa, T. Fujii, K. Fujisue, K. Fujita, R. Fujiwara, M. Fukushima, G. Furlich, N. Globus, R. Gonzalez, W. Hanlon, N. Hayashida, H. He, R. Hibi, K. Hibino, R. Higuchi, K. Honda, D. Ikeda, N. Inoue, T. Ishii, H. Ito, D. Ivanov, A. Iwasaki, H.M. Jeong, S. Jeong, C.C.H. Jui, K. Kadota, F. Kakimoto, O. Kalashev, K. Kasahara, S. Kasami, S. Kawakami, K. Kawata, I. Kharuk, E. Kido, H.B. Kim, J.H. Kim, J.H. Kim, S.W. Kim, Y. Kimura, I. Komae, V. Kuzmin, M. Kuznetsov, Y.J. Kwon, K.H. Lee, B. Lubsandorzhiev, J.P. Lundquist, H. Matsumiya, T. Matsuyama, J.N. Matthews, R. Mayta, K. Mizuno, M. Murakami, I. Myers, K.H. Lee, S. Nagataki, K. Nakai, T. Nakamura, E. Nishio, T. Nonaka, H. Oda, S. Ogio, M. Onishi, H. Ohoka, N. Okazaki, Y. Oku, T. Okuda, Y. Omura, M. Ono, A. Oshima, H. Oshima, S. Ozawa, I.H. Park, K.Y. Park, M. Potts, M.S. Pshirkov, J. Remington, D.C. Rodriguez, C. Rott, G.I. Rubtsov, D. Ryu, H. Sagawa, R. Saito, N. Sakaki, T. Sako, N. Sakurai, D. Sato, K. Sato", "subjects": "Subjects:\nHigh Energy Astrophysical Phenomena (astro-ph.HE)", "abstract": "We report an estimation of the injected mass composition of ultra-high energy cosmic rays (UHECRs) at energies higher than 10 EeV. The composition is inferred from an energy-dependent sky distribution of UHECR events observed by the Telescope Array surface detector by comparing it to the Large Scale Structure of the local Universe. In the case of negligible extra-galactic magnetic fields the results are consistent with a relatively heavy injected composition at E ~ 10 EeV that becomes lighter up to E ~ 100 EeV, while the composition at E > 100 EeV is very heavy. The latter is true even in the presence of highest experimentally allowed extra-galactic magnetic fields, while the composition at lower energies can be light if a strong EGMF is present. The effect of the uncertainty in the galactic magnetic field on these results is subdominant."}
{"main_page": "https://arxiv.org/abs/", "pdf": "https://arxiv.org/pdf/", "title": "Title:\n          M31 nucleus: molecular and ionised gas content upper limits", "authors": "Anne-Laure Melchior, Francoise Combes", "subjects": "Subjects:\nAstrophysics of Galaxies (astro-ph.GA)", "abstract": "We report NOEMA and ALMA observations of the nucleus of Andromeda (M31), putting strong constraints on the presence of gas in the form of cold or warm phase, as proposed by Chang et al. M31 hosts the largest supermassive black hole (SMBH) closer than 1 Mpc from us. Its nucleus is silent with some murmurs at the level of 4 10$^{-9}$ L$_{Edd}$, and is surrounded by a 5-pc-radius disk of old stars. The mass-loss from these stars is expected to fill a molecular gas disk within the tidal truncation of 1 pc (0.26\"), of 10$^4$ Mo, corresponding to a CO(1-0) signal of 2mJy with a linewidth of 1000km/s. We observed the nucleus with NOEMA in CO(2-1) and with ALMA in CO(3-2) with angular resolutions of 0.5\" (1.9 pc) and 0.12\" (0.46 pc) respectively. We exclude the presence of gas with a 3$\\sigma$ upper limit of 195 Mo. The CO(3-2) upper limit also constrains warm gas, escaping detection in CO(1-0). The scenario proposed by Chang et al. is not verified, and instead the hot gas, expelled by the stellar winds, might never cool nor fall onto the disc. Alternatively, the stellar wind mass-loss rate can have been overestimated by a factor 50, and/or the ionised gas escaped from the nucleus. The SMBH in M31 is obviously in a low state of activity, similar to what is observed for Sgr A* in the Milky Way (MW). Recently, a cool (10$^4$ K) ionised accretion disc has been detected around Sgr A* in the H30$\\alpha$ recombination line with ALMA. Re-scaling sizes, masses and fluxes according to the mass of M31's black hole (35 times higher than in the MW) and the distances, a similar disc could be easily detectable around M31 nucleus with an expected signal 8 times weaker that the signal detected in SgrA*. We searched for an ionised gas disc around M31 nucleus with NOEMA, and put a 3$\\sigma$ upper limit on the H30$\\alpha$ recombination line at a level twice lower than expected with a simple scaling of the SgrA*."}
{"main_page": "https://arxiv.org/abs/", "pdf": "https://arxiv.org/pdf/", "title": "Title:\n          Vector Resonant Relaxation and Statistical Closure Theory. I. Direct Interaction Approximation", "authors": "Sofia Flores, Jean-Baptiste Fouvry", "subjects": "Subjects:\nAstrophysics of Galaxies (astro-ph.GA); Statistical Mechanics (cond-mat.stat-mech)", "abstract": "Stars orbiting a supermassive black hole in the center of galaxies undergo very efficient diffusion in their orbital orientations. This is \"Vector Resonant Relaxation\", a diffusion process formally occurring on the unit sphere. Such a dynamics is intrinsically non-linear, stochastic, and correlated, hence bearing deep similarities with turbulence in fluid mechanics or plasma physics. In that context, we show how generic methods stemming from statistical closure theory, namely the celebrated \"Martin-Siggia-Rose formalism\", can be used to characterize the correlations describing the redistribution of orbital orientations. In particular, limiting ourselves to the leading order truncation in this closure scheme, the so-called \"Direct Interaction Approximation\", and placing ourselves in the limit of an isotropic distribution of orientations, we explicitly compare the associated prediction for the two-point correlation function with measures from numerical simulations. We discuss the successes and limitations of this approach and present possible future venues."}
{"main_page": "https://arxiv.org/abs/", "pdf": "https://arxiv.org/pdf/", "title": "Title:\n          The AMS-02 cosmic ray deuteron flux is consistent with a secondary origin", "authors": "Qiang Yuan (PMO, USTC), Yi-Zhong Fan (PMO, USTC)", "subjects": "Subjects:\nHigh Energy Astrophysical Phenomena (astro-ph.HE); High Energy Physics - Phenomenology (hep-ph)", "abstract": "The recent measurements of cosmic ray deuteron fluxes by AMS-02 show that the rigidity dependence of deuterons is similar with that of protons but flatter than $^3$He, which has been attributed to the existence of primary deuterons with abundance much higher than that from the Big Bang nucleosynthesis. The requirement of highly deuteron-abundant sources imposes a serious challenge on the modern astrophysics since there is no known process to produce a large amount of deuterons without violating other constraints \\cite{1976Natur.263..198E}. In this work we demonstrate that the fragmentation of heavy nuclei up to iron plays a crucial role in shaping/enhancing the spectrum/flux of the cosmic ray deuterons. Based on the latest cosmic ray data, the predicted secondary fluxes of deuterons and $^3$He are found to be reasonably consistent with the AMS-02 measurements and a primary deuteron component is not needed. The apparent difference between D/$^4$He (D/p) and $^3$He/$^4$He ($^3$He/p) is probably due to a combined effect of the kinetic-energy-to-rigidity conversion and the solar modulation. More precise measurements of the fragmentation cross sections of various nuclei to produce deuterons, tritons, and $^3$He in a wide energy range will be very helpful in further testing the secondary origin of cosmic ray deuterons."}
{"main_page": "https://arxiv.org/abs/", "pdf": "https://arxiv.org/pdf/", "title": "Title:\n          A Superfluid Dark Matter Cosmic String Wake", "authors": "Aline Favero, Robert Brandenberger", "subjects": "Subjects:\nCosmology and Nongalactic Astrophysics (astro-ph.CO); General Relativity and Quantum Cosmology (gr-qc); High Energy Physics - Phenomenology (hep-ph); High Energy Physics - Theory (hep-th)", "abstract": "We study the effects of superfluid dark matter on the structure of a cosmic string wake, considering both the effects of regular and quantum pressure terms. We consider the total fluid to consist of a combination of baryons and dark matter. Hence, we are also able to study the effects of superfluid dark matter on the distribution of baryons inside the wake. We focus on parameter values for the superfluid dark matter which allow a MONDian explanation of galaxy rotation curves."}
{"main_page": "https://arxiv.org/abs/", "pdf": "https://arxiv.org/pdf/", "title": "Title:\n          A Contact Binary Satellite of the Asteroid (152830) Dinkinesh", "authors": "Harold F. Levison, Simone Marchi, Keith S. Noll, John R. Spencer, Thomas S. Statler, the Lucy mission team", "subjects": "Subjects:\nEarth and Planetary Astrophysics (astro-ph.EP)", "abstract": "Asteroids with diameters less than about 5 km have complex histories because they are small enough for radiative torques, YORP, to be a notable factor in their evolution. (152830) Dinkinesh is a small asteroid orbiting the Sun near the inner edge of the Main Asteroid Belt with a heliocentric semimajor axis of 2.19 AU; its S type spectrum is typical of bodies in this part of the Main Belt. Here we report observations by the Lucy spacecraft as it passed within 431 km of Dinkinesh. Lucy revealed Dinkinesh, which has an effective diameter of only $\\sim$720 m, to be unexpectedly complex. Of particular note is the presence of a prominent longitudinal trough overlain by a substantial equatorial ridge, and the discovery of the first confirmed contact binary satellite, now named (152830) Dinkinesh I Selam. Selam consists of two near-equal sized lobes with diameters of $\\sim$210 m and $\\sim$230 m. It orbits Dinkinesh at a distance of 3.1 km with an orbital period of about 52.7 hr, and is tidally locked. The dynamical state, angular momentum, and geomorphologic observations of the system lead us to infer that the ridge and trough of Dinkinesh are probably the result of mass failure resulting from spin-up by YORP followed by the partial reaccretion of the shed material. Selam probably accreted from material shed by this event."}
{"main_page": "https://arxiv.org/abs/", "pdf": "https://arxiv.org/pdf/", "title": "Title:\n          PUREPath: A Deep Latent Variational Model for Estimating CMB Posterior over Large Angular Scales of the Sky", "authors": "Vipin Sudevan, Pisin Chen", "subjects": "Subjects:\nCosmology and Nongalactic Astrophysics (astro-ph.CO)", "abstract": "We present a comprehensive neural architecture, the PUREPath, which leverages a nested Probabilistic multi-modal U- Net framework, augmented by the inclusion of probabilistic ResNet blocks in the Expanding Pathway of the decoders, to estimate the posterior density of the Cosmic Microwave Background (CMB) signal conditioned on the observed CMB data and the training dataset. By seamlessly integrating Bayesian statistics and variational methods our model effectively minimizes foreground contamination in the observed CMB maps. The model is trained using foreground and noise contaminated CMB temperature maps simulated at Planck LFI and HFI frequency channels 30 - 353 GHz using publicly available Code for Anisotropies in the Microwave Background (CAMB) and Python Sky Model (PySM) packages. During training, our model transforms initial prior distribution on the model parameters to posterior distributions based on the training data. From the joint full posterior of the model parameters, during inference, a predicitve CMB posterior and summary statistics such as the predictive mean, variance etc of the cleaned CMB map is estimated. The predictive standard deviation map provides a direct and interpretable measure of uncertainty per pixel in the predicted mean CMB map. The cleaned CMB map along with the error estimates can be used for more accurate measurements of cosmological parameters and other cosmological analyses."}
{"main_page": "https://arxiv.org/abs/", "pdf": "https://arxiv.org/pdf/", "title": "Title:\n          Calibrating and standardizing the Tip of the Red Giant Branch in the Small Magellanic Cloud using small-amplitude red giants", "authors": "Nolan W. Koblischke, Richard I. Anderson", "subjects": "Subjects:\nSolar and Stellar Astrophysics (astro-ph.SR); Cosmology and Nongalactic Astrophysics (astro-ph.CO)", "abstract": "We investigate the absolute calibration of the Tip of the Red Giant Branch (TRGB) in the Small Magellanic Cloud (SMC) using small amplitude red giant stars (SARGs) classified by the Optical Gravitational Lensing Experiment (OGLE). We show that all stars near the SMC's TRGB are SARGs. Distinguishing older and younger RGs near the Tip according to two period-luminosity sequences labeled A and B, we show many similarities among SARG populations of the LMC and the SMC, along with notable differences. Specifically, SMC SARGs have shorter periods due to lower metallicity and lower amplitudes due to younger ages than LMC SARGs. We discover two period-color relations near the TRGB that span all A-sequence and B-sequence stars in the OGLE-III footprints of the SMC and LMC, and we investigate using periods instead of color for TRGB standardization. Using variability derived information only, we trace the SMC's age and metallicity gradients and show the core to be populated by younger, more metal rich RGs. B-sequence SARGs yield both the most precise and the brightest tip magnitude, and they are best suited for distance determination and Hubble constant measurements because they correspond to the oldest stars near TRGB. Assuming the geometric distance measured by detached eclipsing binaries, the B-sequence yields the SMC's most accurate TRGB calibration to date: M_{F814W,syn} = -4.057 \\pm 0.019(stat.) \\pm 0.029(syst.) mag (1.5% in distance). Further study of SARGs will unravel the impact of population diversity on TRGB distances and further improve TRGB standardization."}
{"main_page": "https://arxiv.org/abs/", "pdf": "https://arxiv.org/pdf/", "title": "Title:\n          A Machine Learning Method for Monte Carlo Calculations of Radiative Processes", "authors": "William Charles, Alexander Y. Chen", "subjects": "Subjects:\nHigh Energy Astrophysical Phenomena (astro-ph.HE)", "abstract": "Radiative processes such as synchrotron radiation and Compton scattering play an important role in astrophysics. Radiative processes are fundamentally stochastic in nature, and the best tools currently used for resolving these processes computationally are Monte Carlo (MC) methods. These methods typically draw a large number of samples from a complex distribution such as the differential cross section for electron-photon scattering, and then use these samples to compute the radiation properties such as angular distribution, spectrum, and polarization. In this work we propose a machine learning (ML) technique for efficient sampling from arbitrary known probability distributions that can be used to accelerate Monte Carlo calculation of radiative processes in astrophysical scenarios. In particular, we apply our technique to inverse Compton radiation and find that our ML method can be up to an order of magnitude faster than traditional methods currently in use."}
