{"main_page": "https://arxiv.org/abs/", "pdf": "https://arxiv.org/pdf/", "title": "Title:\n          Battery Operations in Electricity Markets: Strategic Behavior and Distortions", "authors": "Jerry Anunrojwong, Santiago R. Balseiro, Omar Besbes, Bolun Xu", "subjects": "Subjects:\nTheoretical Economics (econ.TH); Systems and Control (eess.SY)", "abstract": "Electric power systems are undergoing a major transformation as they integrate intermittent renewable energy sources, and batteries to smooth out variations in renewable energy production. As privately-owned batteries grow from their role as marginal \"price-takers\" to significant players in the market, a natural question arises: How do batteries operate in electricity markets, and how does the strategic behavior of decentralized batteries distort decisions compared to centralized batteries? We propose an analytically tractable model that captures salient features of the highly complex electricity market. We derive in closed form the resulting battery behavior and generation cost in three operating regimes: (i) no battery, (ii) centralized battery, and (ii) decentralized profit-maximizing battery. We establish that a decentralized battery distorts its discharge decisions in three ways. First, there is quantity withholding, i.e., discharging less than centrally optimal. Second, there is a shift in participation from day-ahead to real-time, i.e., postponing some of its discharge from day-ahead to real-time. Third, there is reduction in real-time responsiveness, or discharging less in response to smoothing real-time demand than centrally optimal. We quantify each of the three forms of distortions in terms of market fundamentals. To illustrate our results, we calibrate our model to Los Angeles and Houston and show that the loss from incentive misalignment could be consequential."}
{"main_page": "https://arxiv.org/abs/", "pdf": "https://arxiv.org/pdf/", "title": "Title:\n          A Note on Identification of Match Fixed Effects as Interpretable Unobserved Match Affinity", "authors": "Suguru Otani, Tohya Sugano", "subjects": "Subjects:\nEconometrics (econ.EM)", "abstract": "We highlight that match fixed effects, represented by the coefficients of interaction terms involving dummy variables for two elements, lack identification without specific restrictions on parameters. Consequently, the coefficients typically reported as relative match fixed effects by statistical software are not interpretable. To address this, we establish normalization conditions that enable identification of match fixed effect parameters as interpretable indicators of unobserved match affinity, facilitating comparisons among observed matches."}
{"main_page": "https://arxiv.org/abs/", "pdf": "https://arxiv.org/pdf/", "title": "Title:\n          Credit Ratings: Heterogeneous Effect on Capital Structure", "authors": "Helmut Wasserbacher, Martin Spindler", "subjects": "Subjects:\nGeneral Economics (econ.GN); Applications (stat.AP)", "abstract": "Why do companies choose particular capital structures? A compelling answer to this question remains elusive despite extensive research. In this article, we use double machine learning to examine the heterogeneous causal effect of credit ratings on leverage. Taking advantage of the flexibility of random forests within the double machine learning framework, we model the relationship between variables associated with leverage and credit ratings without imposing strong assumptions about their functional form. This approach also allows for data-driven variable selection from a large set of individual company characteristics, supporting valid causal inference. We report three findings: First, credit ratings causally affect the leverage ratio. Having a rating, as opposed to having none, increases leverage by approximately 7 to 9 percentage points, or 30\\% to 40\\% relative to the sample mean leverage. However, this result comes with an important caveat, captured in our second finding: the effect is highly heterogeneous and varies depending on the specific rating. For AAA and AA ratings, the effect is negative, reducing leverage by about 5 percentage points. For A and BBB ratings, the effect is approximately zero. From BB ratings onwards, the effect becomes positive, exceeding 10 percentage points. Third, contrary to what the second finding might imply at first glance, the change from no effect to a positive effect does not occur abruptly at the boundary between investment and speculative grade ratings. Rather, it is gradual, taking place across the granular rating notches (\"+/-\") within the BBB and BB categories."}
{"main_page": "https://arxiv.org/abs/", "pdf": "https://arxiv.org/pdf/", "title": "Title:\n          Factor multivariate stochastic volatility models of high dimension", "authors": "Benjamin Poignard, Manabu Asai", "subjects": "Subjects:\nEconometrics (econ.EM)", "abstract": "Building upon the pertinence of the factor decomposition to break the curse of dimensionality inherent to multivariate volatility processes, we develop a factor model-based multivariate stochastic volatility (fMSV) framework that relies on two viewpoints: sparse approximate factor model and sparse factor loading matrix. We propose a two-stage estimation procedure for the fMSV model: the first stage obtains the estimators of the factor model, and the second stage estimates the MSV part using the estimated common factor variables. We derive the asymptotic properties of the estimators. Simulated experiments are performed to assess the forecasting performances of the covariance matrices. The empirical analysis based on vectors of asset returns illustrates that the forecasting performances of the fMSV models outperforms competing conditional covariance models."}
{"main_page": "https://arxiv.org/abs/", "pdf": "https://arxiv.org/pdf/", "title": "Title:\n          Convex Choice", "authors": "Navin Kartik, Andreas Kleiner", "subjects": "Subjects:\nTheoretical Economics (econ.TH)", "abstract": "For multidimensional Euclidean type spaces, we study convex choice: from any choice set, the set of types that make the same choice is convex. We establish that, in a suitable sense, this property characterizes the sufficiency of local incentive constraints. Convex choice is also of interest more broadly. We tie convex choice to a notion of directional single-crossing differences (DSCD). For an expected-utility agent choosing among lotteries, DSCD implies that preferences are either one-dimensional or must take the affine form that has been tractable in multidimensional mechanism design."}
{"main_page": "https://arxiv.org/abs/", "pdf": "https://arxiv.org/pdf/", "title": "Title:\n          The myth of declining competitive balance in the UEFA Champions League group stage", "authors": "László Csató, Dóra Gréta Petróczy", "subjects": "Subjects:\nGeneral Economics (econ.GN); Physics and Society (physics.soc-ph); Applications (stat.AP)", "abstract": "According to previous studies, competitive balance has significantly declined in the UEFA Champions League group stage over the recent decades. Our paper introduces six alternative indices for measuring ex ante and ex post competitive balance in order to explore the robustness of these results. The ex ante measures are based on Elo ratings, while the ex post measures compare the group ranking to reasonable benchmarks. We find no evidence of any trend in the competitive balance of the UEFA Champions League group stage between the 2003/04 and 2023/24 seasons."}
